vinh107108/amazon-freertos/projects/renesas/rx65n-rsk/e2studio/boot_loader/src/smc_gen/r_fwup/src/r_fwup_boot_loader.c
/**********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
 * SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2021 Renesas Electronics Corporation. All rights reserved.
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * File Name     : r_fwup_boot_loader.c
 * Description   : Functions for the Firmware update module.
 *********************************************************************************************************************/
/**********************************************************************************************************************
 * History : DD.MM.YYYY Version Description
 *           16.02.2021 1.00    First Release
 *           19.05.2021 1.01    Added support for RX72N,RX66T,RX130
 *           08.07.2021 1.02    Added support for RX671 and GCC
 *           10.08.2021 1.03    Added support for IAR
 *           25.03.2022 1.04    Change the supported FreeRTOS version
 *                              Select data area from DF/CF
 *                              Added support for RX140-256KB
 *********************************************************************************************************************/

#include <stdio.h>
#include <string.h>
#include "r_fwup_config.h"  /* Firmware update config definitions */
#if (FWUP_CFG_IMPLEMENTATION_ENVIRONMENT == 2) /* FWUP_IMPLEMENTATION_AFRTOS */
#include "ota_platform_interface.h"
#endif
#include "r_smc_entry.h"
#include "r_flash_rx_if.h"
#include "r_sci_rx_if.h"
#include "r_sys_time_rx_if.h"
#include "r_fwup_if.h"
#include "r_fwup_private.h"

#if (FWUP_CFG_IMPLEMENTATION_ENVIRONMENT == FWUP_IMPLEMENTATION_BOOTLOADER)
#include "r_sci_rx_pinset.h"

#include "base64_decode.h"
#include "code_signer_public_key.h"

/* tinycrypt */
#include "tinycrypt/sha256.h"
#include "tinycrypt/ecc.h"
#include "tinycrypt/ecc_dsa.h"
#include "tinycrypt/constants.h"

#define BOOT_LOADER_SCI_CONTROL_BLOCK_A         (0)
#define BOOT_LOADER_SCI_CONTROL_BLOCK_B         (1)
#define BOOT_LOADER_SCI_CONTROL_BLOCK_TOTAL_NUM (2)

#define BOOT_LOADER_SCI_RECEIVE_BUFFER_EMPTY    (0)
#define BOOT_LOADER_SCI_RECEIVE_BUFFER_FULL     (1)

#define FLASH_DF_TOTAL_BLOCK_SIZE               (FLASH_DF_BLOCK_INVALID - FLASH_DF_BLOCK_0)

#define INTEGRITY_CHECK_SCHEME_HASH_SHA256_STANDALONE      "hash-sha256"
#define INTEGRITY_CHECK_SCHEME_SIG_SHA256_ECDSA_STANDALONE "sig-sha256-ecdsa"

typedef struct st_load_const_data_ctrl_block
{
    uint32_t flash_buffer[FWUP_WRITE_BLOCK_SIZE / 4];
    uint32_t offset;
    uint32_t progress;
} st_load_const_data_ctrl_block_t;

const uint8_t g_code_signer_public_key[] = CODE_SIGNER_PUBLIC_KEY_PEM;
const uint32_t g_code_signer_public_key_length = sizeof(g_code_signer_public_key);

uint32_t g_error_count1 = 0;
uint32_t g_error_count2 = 0;
uint32_t g_rcv_count1 = 0;
uint32_t g_rcv_count2 = 0;

/* Handle storage. */
static st_sci_receive_control_block_t s_sci_receive_control_block;
static st_sci_buffer_control_t s_sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_TOTAL_NUM];

/* static int32_t secure_boot(void); */
static int32_t firm_block_read (uint32_t * firmware, uint32_t offset);
static int32_t const_data_block_read (uint32_t * const_data, uint32_t offset);
static void bank_swap_with_software_reset (void);
static void software_reset (void);
static const uint8_t * get_status_string (uint8_t status);
#if (FWUP_CFG_OTA_DATA_STORAGE == 1)
static flash_err_t s_copy_data_area(void);
static flash_err_t s_set_copy_flag(void);
#endif /* FWUP_CFG_OTA_DATA_STORAGE == 1 */
#if (FLASH_CFG_CODE_FLASH_BGO == 1)
static void my_flash_callback (void * event);
#endif

static st_fwup_control_block_t * sp_fwup_control_block_bank0 =
        (st_fwup_control_block_t *)BOOT_LOADER_UPDATE_EXECUTE_AREA_LOW_ADDRESS;
static st_fwup_control_block_t * sp_fwup_control_block_bank1 =
        (st_fwup_control_block_t *)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS;
static st_load_fw_control_block_t s_load_fw_control_block;
static st_load_const_data_ctrl_block_t s_load_const_data_control_block;
static uint32_t s_block_buffer[BOOT_LOADER_FLASH_CF_BLOCK_SIZE / 4];
static uint32_t s_flash_error_code;
#if (FWUP_CFG_OTA_DATA_STORAGE == 1)
static uint8_t s_last_image_flag;
#endif /* FWUP_CFG_OTA_DATA_STORAGE == 1 */

/* CODE CHECKER, this is OK as a comment precedes the cast. */
static const uint8_t * sp_boot_loader_magic_code = (uint8_t*) BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS;


/***********************************************************************************************************************
 * Function Name: R_FWUP_SecureBoot
 * Description  :
 * Arguments    :
 * Return Value :
 **********************************************************************************************************************/
int32_t R_FWUP_SecureBoot(void)
{
    flash_err_t              flash_api_error_code   = FLASH_SUCCESS;
    int32_t                  secure_boot_error_code = FWUP_IN_PROGRESS;
    e_state_monitoring_err_t monitoring_error_code  = MONI_SUCCESS;  // 20201Q_No5
#if (FWUP_FLASH_BANK_MODE == 0)
    uint32_t bank_info = 255;
#else
    uint32_t tmp_offset;
    uint8_t  loop_cnt;
#endif /* FWUP_FLASH_BANK_MODE */
#if (FLASH_CFG_CODE_FLASH_BGO == 1)
    flash_interrupt_config_t cb_func_info;
#endif /* (FLASH_CFG_CODE_FLASH_BGO == 1) */
#if (FWUP_CFG_OTA_DATA_STORAGE == 1)
    bool    do_copy_flag = false;
#endif /* FWUP_CFG_OTA_DATA_STORAGE == 1 */

    st_fwup_control_block_t * p_fwup_control_block_tmp =
            (st_fwup_control_block_t *)s_block_buffer;
    int32_t verification_result = -1;

    /* Check that the R_FWUP_Open has been executed. */
    if (false == g_is_opened)
    {
        R_SCI_PinSet_serial_term();
        (void)fwup_communication_open();
        fwup_update_status(FWUP_STATE_FATAL_ERROR);
        DEBUG_LOG("ERROR: Not Open.\r\n");
        secure_boot_error_code = FWUP_ERR_NOT_OPEN;
        return secure_boot_error_code;
    }

    if ((FWUP_FAIL != secure_boot_error_code) &&
        (FWUP_ERR_COMM != secure_boot_error_code) &&
        (FWUP_ERR_STATE_MONITORING != secure_boot_error_code))
    {

        /* 20201Q_No5 start */
        /* If state transit error has occured, return FWUP_FAIL to main function */
        if (fwup_state_monitoring_is_error() == STATE_MONITORING_ERROR)
        {
            DEBUG_LOG("Boot status has not changed for 1 minute.\r\n");
            DEBUG_LOG("system error.\r\n");
            fwup_update_status(FWUP_STATE_FATAL_ERROR);
            secure_boot_error_code = FWUP_ERR_STATE_MONITORING;
        }    /* 20201Q_No5 end */

        switch (fwup_get_status())
        {
            case FWUP_STATE_INITIALIZING:
                R_SCI_PinSet_serial_term();

                s_load_fw_control_block.progress = 0;
                s_load_fw_control_block.offset   = 0;

