vinh107108/amazon-freertos/projects/renesas/rx65n-rsk/e2studio/boot_loader/src/smc_gen/r_fwup/src/r_fwup_boot_loader.c
                /* startup system */
                DEBUG_LOG("-------------------------------------------------\r\n");
#if (BSP_MCU_RX65N)
                DEBUG_LOG("RX65N secure boot program\r\n");
#elif (BSP_MCU_RX66T)
                DEBUG_LOG("RX66T secure boot program\r\n");
#elif (BSP_MCU_RX671)
                DEBUG_LOG("RX671 secure boot program\r\n");
#elif (BSP_MCU_RX72N)
                DEBUG_LOG("RX72N secure boot program\r\n");
#elif (BSP_MCU_RX231)
                DEBUG_LOG("RX231 secure boot program\r\n");
#elif (BSP_MCU_RX140)
                DEBUG_LOG("RX140 secure boot program\r\n");
#elif (BSP_MCU_RX130)
                DEBUG_LOG("RX130 secure boot program\r\n");
#else
                DEBUG_LOG("Secure boot program\r\n");
#endif
                DEBUG_LOG("-------------------------------------------------\r\n");

                DEBUG_LOG("Checking flash ROM status.\r\n");

                DEBUG_LOG2("bank 0 status = 0x%x [%s]\r\n", sp_fwup_control_block_bank0->image_flag,
                        get_status_string(sp_fwup_control_block_bank0->image_flag));
                DEBUG_LOG2("bank 1 status = 0x%x [%s]\r\n", sp_fwup_control_block_bank1->image_flag,
                        get_status_string(sp_fwup_control_block_bank1->image_flag));

#if (FWUP_FLASH_BANK_MODE == 0)
                fwup_flash_get_bank_info((flash_bank_t *)&bank_info);
                DEBUG_LOG2("bank info = %d. (start bank = %d)\r\n", bank_info, (bank_info ^ 0x01));
#endif  /* (FWUP_FLASH_BANK_MODE == 0) */

#if (FLASH_CFG_CODE_FLASH_BGO == 1)
                cb_func_info.pcallback = my_flash_callback;
                cb_func_info.int_priority = FLASH_INTERRUPT_PRIORITY;
                fwup_flash_set_callback((void *)&cb_func_info);
#endif  /* (FLASH_CFG_CODE_FLASH_BGO == 1) */

                /* 20201Q_No5 start */
                /* Set System-timer for check status */
                monitoring_error_code = fwup_state_monitoring_start();
                if (MONI_SUCCESS != monitoring_error_code)
                {
                    DEBUG_LOG2("R_SYS_TIME_RegisterPeriodicCallback() returns error. %d.\r\n", monitoring_error_code);
                    DEBUG_LOG("system error.\r\n");
                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                    secure_boot_error_code = FWUP_FAIL;
                    break;
                }    /* 20201Q_No5 end */

                fwup_update_status(FWUP_STATE_BANK1_CHECK);
                break;

            case FWUP_STATE_BANK1_CHECK:
        
                /* Dual mode */
                if (LIFECYCLE_STATE_TESTING == sp_fwup_control_block_bank1->image_flag)
                {
                
                    /* CODE CHECKER, this is OK as a comment precedes the cast. */
                    memcpy(s_block_buffer, (void*)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS,
                            BOOT_LOADER_FLASH_CF_BLOCK_SIZE);

                    DEBUG_LOG2("integrity check scheme = %-.32s\r\n",
                            sp_fwup_control_block_bank1->signature_type);
                    DEBUG_LOG("bank1(temporary area) on code flash integrity check...");

                    /* Firmware verification for the signature type. */
                    if (!strcmp((const char*)sp_fwup_control_block_bank1->signature_type,
                            INTEGRITY_CHECK_SCHEME_HASH_SHA256_STANDALONE))
                    {
                        uint8_t hash_sha256[TC_SHA256_DIGEST_SIZE];

                        /* Hash message */
                        struct tc_sha256_state_struct x_ctx;
                        tc_sha256_init( &x_ctx);
                        tc_sha256_update( &x_ctx,
                                (uint8_t*) BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS
                                        + BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH,
                                (BOOT_LOADER_FLASH_CF_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER)
                                        - BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH);
                        tc_sha256_final(hash_sha256, &x_ctx);
                        verification_result = memcmp(sp_fwup_control_block_bank1->signature, hash_sha256,
                                sizeof(hash_sha256));
                    }
                    else if (!strcmp((const char*)sp_fwup_control_block_bank1->signature_type,
                            INTEGRITY_CHECK_SCHEME_SIG_SHA256_ECDSA_STANDALONE))
                    {

                        /* CODE CHECKER: This multi-line statement needs a comment to identify a cast is used and
                         * describes why the loss of sign (int8_t instead of uint8_t) is OK. As it is multi-line
                         * a comment on the actual line is required. */
                        verification_result = fwup_verification_sha256_ecdsa(
                                (const uint8_t*) BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS
                                        + BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH,
                                (BOOT_LOADER_FLASH_CF_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER)
                                        - BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH,
                                sp_fwup_control_block_bank1->signature,
                                sp_fwup_control_block_bank1->signature_size);
                    }
                    else
                    {
                        verification_result = -1;
                    }

                    if (0 == verification_result)
                    {
                        DEBUG_LOG("OK\r\n");
                        p_fwup_control_block_tmp->image_flag = LIFECYCLE_STATE_VALID;
                    }
                    else
                    {
                        DEBUG_LOG("NG\r\n");
                        p_fwup_control_block_tmp->image_flag = LIFECYCLE_STATE_INVALID;
                    }
                    DEBUG_LOG2("update LIFECYCLE_STATE from [%s] to [%s]\r\n",
                            get_status_string(sp_fwup_control_block_bank1->image_flag),
                            get_status_string(p_fwup_control_block_tmp->image_flag));
                    DEBUG_LOG("bank1(temporary area) block0 erase (to update LIFECYCLE_STATE)...");

