vinh107108/amazon-freertos/projects/renesas/rx65n-rsk/e2studio/boot_loader/src/smc_gen/r_fwup/src/r_fwup_boot_loader.c
                    flash_api_error_code = fwup_flash_erase(
                            (flash_block_address_t) BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS, 1);
                    if (FLASH_SUCCESS != flash_api_error_code)
                    {
                        DEBUG_LOG2("R_FLASH_Erase() returns error. %d.\r\n", s_flash_error_code);
                        DEBUG_LOG("system error.\r\n");
                        fwup_update_status(FWUP_STATE_FATAL_ERROR);
                        secure_boot_error_code = FWUP_FAIL;
                        break; // @suppress("Case break statement")
                    }
#if (FLASH_CFG_CODE_FLASH_BGO == 1)
                    fwup_update_status(FWUP_STATE_BANK1_UPDATE_LIFECYCLE_ERASE_WAIT);
#else
                    fwup_update_status(FWUP_STATE_BANK1_UPDATE_LIFECYCLE_ERASE_COMPLETE);
#endif  /* (FLASH_CFG_CODE_FLASH_BGO == 1) */
                }
#if (FWUP_FLASH_BANK_MODE == 1) /* Linear mode */
                else if (LIFECYCLE_STATE_VALID == sp_fwup_control_block_bank1->image_flag)
                {
                
                    /* CODE CHECKER, this is OK as a comment precedes the cast. */
                    memcpy(s_block_buffer, (void*)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS,
                            BOOT_LOADER_FLASH_CF_BLOCK_SIZE);

                    DEBUG_LOG2("integrity check scheme = %-.32s\r\n",
                            sp_fwup_control_block_bank1->signature_type);
                    DEBUG_LOG("temporary area on code flash integrity check...");

                    /* Firmware verification for the signature type. */
                    if ( !strcmp((const char* )sp_fwup_control_block_bank1->signature_type,
                            INTEGRITY_CHECK_SCHEME_HASH_SHA256_STANDALONE))
                    {
                        uint8_t hash_sha256[TC_SHA256_DIGEST_SIZE];

                        /* Hash message */
                        struct tc_sha256_state_struct x_ctx;
                        tc_sha256_init( &x_ctx);
                        tc_sha256_update( &x_ctx,
                                (uint8_t*) BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS
                                        + BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH,
                                (BOOT_LOADER_FLASH_CF_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER)
                                        - BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH);
                        tc_sha256_final(hash_sha256, &x_ctx);
                        verification_result = memcmp(sp_fwup_control_block_bank1->signature, hash_sha256,
                                sizeof(hash_sha256));
                    }
                    else if ( !strcmp((const char* )sp_fwup_control_block_bank1->signature_type,
                            INTEGRITY_CHECK_SCHEME_SIG_SHA256_ECDSA_STANDALONE))
                    {
                        verification_result = fwup_verification_sha256_ecdsa(
                                (const uint8_t*) BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS
                                        + BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH,
                                (BOOT_LOADER_FLASH_CF_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER)
                                        - BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH,
                                sp_fwup_control_block_bank1->signature,
                                sp_fwup_control_block_bank1->signature_size);
                    }
                    else
                    {
                        verification_result = -1;
                    }

                    if (0 == verification_result)
                    {
                        DEBUG_LOG("OK\r\n");
                    }
                    else
                    {
                        DEBUG_LOG("NG\r\n");
                        DEBUG_LOG("erase bank1 temporary area ...");
                        flash_api_error_code = fwup_flash_erase(
                                (flash_block_address_t) BOOT_LOADER_UPDATE_TEMPORARY_AREA_ERASE_ADDRESS,
                                BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER);
                        if (FLASH_SUCCESS != flash_api_error_code)
                        {
                            DEBUG_LOG2("R_FLASH_Erase() returns error. %d.\r\n", s_flash_error_code);
                            DEBUG_LOG("system error.\r\n");
                            fwup_update_status(FWUP_STATE_FATAL_ERROR);
                            secure_boot_error_code = FWUP_FAIL;
                            break; // @suppress("Case break statement")
                        }
                        DEBUG_LOG("OK\r\n");
                        DEBUG_LOG("software reset...\r\n");
                        R_BSP_SoftwareDelay(3000, BSP_DELAY_MILLISECS);
                        software_reset();
                        while (1);
                    }

                    DEBUG_LOG("erase bank0 execute area ...");
                    flash_api_error_code = fwup_flash_erase(
                            (flash_block_address_t) BOOT_LOADER_UPDATE_EXECUTE_AREA_ERASE_ADDRESS,
                            BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER);
                    if (FLASH_SUCCESS != flash_api_error_code)
                    {
                        DEBUG_LOG2("R_FLASH_Erase() returns error. %d.\r\n", s_flash_error_code);
                        DEBUG_LOG("system error.\r\n");
                        fwup_update_status(FWUP_STATE_FATAL_ERROR);
                        secure_boot_error_code = FWUP_FAIL;
                        break; // @suppress("Case break statement")
                    }
                    DEBUG_LOG("OK\r\n");

                    DEBUG_LOG("copy the temporary area to the execution area ...");
                
                    /* CODE CHECKER, this is OK as a comment precedes the cast. */
                    tmp_offset = (uint32_t) BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS;
                    for (loop_cnt = 0; BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER > loop_cnt; loop_cnt++)
                    {
                    
                        /* CODE CHECKER, this is OK as a comment precedes the cast. */
                        memcpy(s_block_buffer, (void* )tmp_offset, BOOT_LOADER_FLASH_CF_BLOCK_SIZE);
                        flash_api_error_code = fwup_flash_write((uint32_t) s_block_buffer,
                            (uint32_t) (BOOT_LOADER_UPDATE_EXECUTE_AREA_LOW_ADDRESS +
                                (BOOT_LOADER_FLASH_CF_BLOCK_SIZE * loop_cnt)), BOOT_LOADER_FLASH_CF_BLOCK_SIZE);
                        if (FLASH_SUCCESS != flash_api_error_code)
                        {
                            break;
                        }
                        tmp_offset = tmp_offset + BOOT_LOADER_FLASH_CF_BLOCK_SIZE;
                    }
                    if (FLASH_SUCCESS != flash_api_error_code)
                    {
                        DEBUG_LOG2("R_FLASH_Write() returns error. %d.\r\n", s_flash_error_code);
                        DEBUG_LOG("system error.\r\n");
                        fwup_update_status(FWUP_STATE_FATAL_ERROR);
                        secure_boot_error_code = FWUP_FAIL;
                        break;
                    }
                    DEBUG_LOG("OK\r\n");

                    DEBUG_LOG2("integrity check scheme = %-.32s\r\n",
                            sp_fwup_control_block_bank0->signature_type);
                    DEBUG_LOG("execution area on code flash integrity check...");

                    /* Firmware verification for the signature type. */
                    if ( !strcmp((const char* )sp_fwup_control_block_bank0->signature_type,
                            INTEGRITY_CHECK_SCHEME_HASH_SHA256_STANDALONE))
                    {
                        uint8_t hash_sha256[TC_SHA256_DIGEST_SIZE];

                        /* Hash message */
                        struct tc_sha256_state_struct x_ctx;
                        tc_sha256_init( &x_ctx);
                        tc_sha256_update( &x_ctx,
                                (uint8_t*) BOOT_LOADER_UPDATE_EXECUTE_AREA_LOW_ADDRESS
                                        + BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH,
                                (BOOT_LOADER_FLASH_CF_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER)
                                        - BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH);
                        tc_sha256_final(hash_sha256, &x_ctx);
                        verification_result = memcmp(sp_fwup_control_block_bank0->signature, hash_sha256,
                                sizeof(hash_sha256));
                    }
                    else if ( !strcmp((const char* )sp_fwup_control_block_bank0->signature_type,
                            INTEGRITY_CHECK_SCHEME_SIG_SHA256_ECDSA_STANDALONE))
                    {
                        verification_result = fwup_verification_sha256_ecdsa(
                                (const uint8_t*) BOOT_LOADER_UPDATE_EXECUTE_AREA_LOW_ADDRESS
                                        + BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH,
                                (BOOT_LOADER_FLASH_CF_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER)
                                        - BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH,
                                sp_fwup_control_block_bank0->signature,
                                sp_fwup_control_block_bank0->signature_size);
                    }
                    else
                    {
                        verification_result = -1;
                    }

