vinh107108/amazon-freertos/projects/renesas/rx65n-rsk/e2studio/boot_loader/src/smc_gen/r_fwup/src/r_fwup_boot_loader.c
                    if (0 == verification_result)
                    {
                        DEBUG_LOG("OK\r\n");
                        DEBUG_LOG("erase bank1 temporary area ...");
                        flash_api_error_code = fwup_flash_erase(
                                (flash_block_address_t) BOOT_LOADER_UPDATE_TEMPORARY_AREA_ERASE_ADDRESS,
                                BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER);
                        if (FLASH_SUCCESS != flash_api_error_code)
                        {
                            DEBUG_LOG2("R_FLASH_Erase() returns error. %d.\r\n", s_flash_error_code);
                            DEBUG_LOG("system error.\r\n");
                            fwup_update_status(FWUP_STATE_FATAL_ERROR);
                            secure_boot_error_code = FWUP_FAIL;
                            break; // @suppress("Case break statement")
                        }
                        DEBUG_LOG("OK\r\n");
                    }
                    else
                    {
                        DEBUG_LOG("NG\r\n");
                        fwup_update_status(FWUP_STATE_FATAL_ERROR);
                        secure_boot_error_code = FWUP_FAIL;
                        break; // @suppress("Case break statement")
                    }

                    DEBUG_LOG("jump to user program\r\n");
                    R_BSP_SoftwareDelay(1000, BSP_DELAY_MILLISECS);
                    fwup_update_status(FWUP_STATE_BANK1_UPDATE_LIFECYCLE_ERASE_COMPLETE);
                    secure_boot_error_code = FWUP_SUCCESS;
                    break; // @suppress("Case break statement")
                }
                else if (LIFECYCLE_STATE_EOL == sp_fwup_control_block_bank1->image_flag)
                {
                    DEBUG_LOG("End Of Life process start.\r\n");

                    /* CODE CHECKER, this is OK as a comment precedes the cast. */
                    memcpy(s_block_buffer, (void*)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS,
                            BOOT_LOADER_FLASH_CF_BLOCK_SIZE);
                    p_fwup_control_block_tmp->image_flag = LIFECYCLE_STATE_EOL;
                    DEBUG_LOG2("update LIFECYCLE_STATE from [%s] to [%s]\r\n",
                            get_status_string(sp_fwup_control_block_bank0->image_flag),
                            get_status_string(p_fwup_control_block_tmp->image_flag));
                    DEBUG_LOG("bank0(Excecute area) block0 write (to update LIFECYCLE_STATE)...");
                    flash_api_error_code = fwup_flash_erase(
                            (flash_block_address_t) BOOT_LOADER_UPDATE_EXECUTE_AREA_ERASE_ADDRESS,
                            BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER);
                    if (FLASH_SUCCESS != flash_api_error_code)
                    {
                        DEBUG_LOG("NG.\r\n");
                        DEBUG_LOG2("R_FLASH_Erase() returns error. %d.\r\n", s_flash_error_code);
                        DEBUG_LOG("system error.\r\n");
                        fwup_update_status(FWUP_STATE_FATAL_ERROR);
                        secure_boot_error_code = FWUP_FAIL;
                        break; // @suppress("Case break statement")
                    }

                    flash_api_error_code = fwup_flash_write((uint32_t) p_fwup_control_block_tmp,
                            (uint32_t) BOOT_LOADER_UPDATE_EXECUTE_AREA_LOW_ADDRESS, BOOT_LOADER_FLASH_CF_BLOCK_SIZE);
                    if (FLASH_SUCCESS == flash_api_error_code)
                    {
                        DEBUG_LOG("OK\r\n");
                        DEBUG_LOG2("bank 0 status = 0x%x [%s]\r\n", sp_fwup_control_block_bank0->image_flag,
                                get_status_string(sp_fwup_control_block_bank0->image_flag));
                        DEBUG_LOG2("bank 1 status = 0x%x [%s]\r\n", sp_fwup_control_block_bank1->image_flag,
                                get_status_string(sp_fwup_control_block_bank1->image_flag));
                    }
                    else
                    {
                        DEBUG_LOG2("R_FLASH_Write() returns error. %d.\r\n", s_flash_error_code);
                        DEBUG_LOG("system error.\r\n");
                        fwup_update_status(FWUP_STATE_FATAL_ERROR);
                        secure_boot_error_code = FWUP_FAIL;
                        break; // @suppress("Case break statement")
                    }

                    DEBUG_LOG("erase install area (data flash): ");
                    flash_api_error_code = fwup_flash_erase((flash_block_address_t) BOOT_LOADER_USER_CONST_DATA_LOW_ADDRESS,
                            BOOT_LOADER_UPDATE_CONST_DATA_TARGET_BLOCK_NUMBER);
                    if (FLASH_SUCCESS != flash_api_error_code)
                    {
                        DEBUG_LOG2("R_FLASH_Erase() returns error. %d.\r\n", s_flash_error_code);
                        DEBUG_LOG("system error.\r\n");
                        fwup_update_status(FWUP_STATE_FATAL_ERROR);
                        secure_boot_error_code = FWUP_FAIL;
                        break; // @suppress("Case break statement")
                    }

                    /* End of the EOL process, infinity loop on Bootloader */
                    DEBUG_LOG("OK\r\n");
                    DEBUG_LOG("End Of Life process finished.\r\n");
                    R_BSP_SoftwareDelay(1000, BSP_DELAY_MILLISECS);
                    secure_boot_error_code = FWUP_END_OF_LIFE;
                    break; // @suppress("Case break statement")
                }
#endif /* (FWUP_FLASH_BANK_MODE == 1) */
                else
                {
                    if (LIFECYCLE_STATE_VALID == sp_fwup_control_block_bank0->image_flag)
                    {
                        fwup_update_status(FWUP_STATE_BANK0_UPDATE_CHECK);
                    }
                    else
                    {
                        fwup_update_status(FWUP_STATE_BANK0_CHECK);
                    }
                }
                break;

            case FWUP_STATE_BANK1_UPDATE_LIFECYCLE_ERASE_WAIT:

