vinh107108/amazon-freertos/projects/renesas/rx65n-rsk/e2studio/boot_loader/src/smc_gen/r_fwup/src/r_fwup_boot_loader.c
                /* this state will be update by flash callback */
                break;

            case FWUP_STATE_BANK1_UPDATE_LIFECYCLE_ERASE_COMPLETE:
                if (FLASH_SUCCESS == s_flash_error_code)
                {
                    DEBUG_LOG("OK\r\n");
                }
                else
                {
                    DEBUG_LOG2("R_FLASH_Erase() callback error. %d.\r\n", s_flash_error_code);
                    DEBUG_LOG("system error.\r\n");
                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                    secure_boot_error_code = FWUP_FAIL;
                    break; // @suppress("Case break statement")
                }
                DEBUG_LOG("bank1(temporary area) block0 write (to update LIFECYCLE_STATE)...");
                flash_api_error_code = fwup_flash_write((uint32_t) p_fwup_control_block_tmp,
                        (uint32_t) BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS, BOOT_LOADER_FLASH_CF_BLOCK_SIZE);
                if (FLASH_SUCCESS != flash_api_error_code)
                {
                    DEBUG_LOG2("R_FLASH_Write() returns error. %d.\r\n", s_flash_error_code);
                    DEBUG_LOG("system error.\r\n");
                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                    secure_boot_error_code = FWUP_FAIL;
                    break; // @suppress("Case break statement")
                }
#if (FLASH_CFG_CODE_FLASH_BGO == 1)
                fwup_update_status(FWUP_STATE_BANK1_UPDATE_LIFECYCLE_WRITE_WAIT);
#else
                fwup_update_status(FWUP_STATE_BANK1_UPDATE_LIFECYCLE_WRITE_COMPLETE);
#endif  /* (FLASH_CFG_CODE_FLASH_BGO == 1) */
                break;

            case FWUP_STATE_BANK1_UPDATE_LIFECYCLE_WRITE_WAIT:

                /* this state will be update by flash callback */
                break;

            case FWUP_STATE_BANK1_UPDATE_LIFECYCLE_WRITE_COMPLETE:
                if (FLASH_SUCCESS == s_flash_error_code)
                {
                    DEBUG_LOG("OK\r\n");
                }
                else
                {
                    DEBUG_LOG2("R_FLASH_Write() callback error. %d.\r\n", s_flash_error_code);
                    DEBUG_LOG("system error.\r\n");
                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                    secure_boot_error_code = FWUP_FAIL;
                    break; // @suppress("Case break statement")
                }

                if (LIFECYCLE_STATE_VALID == p_fwup_control_block_tmp->image_flag)
                {
                    DEBUG_LOG(
                            "swap bank...[FWUP_STATE_BANK1_UPDATE_LIFECYCLE_WRITE_COMPLETE and LIFECYCLE_STATE_VALID]\r\n");
                    R_BSP_SoftwareDelay(3000, BSP_DELAY_MILLISECS);
                    bank_swap_with_software_reset();
                    while (1)
                    {
                        ;
                    }
                }
                else
                {
                    DEBUG_LOG("software reset...\r\n");
                    R_BSP_SoftwareDelay(3000, BSP_DELAY_MILLISECS);
                    software_reset();
                    while (1)
                    {
                        ;
                    }
                }
                break;

            case FWUP_STATE_BANK0_CHECK:
            case FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_WAIT:
            case FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_COMPLETE:
            case FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_WAIT:
            case FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_COMPLETE:
            case FWUP_STATE_INSTALL_DATA_FLASH_ERASE_WAIT:
            case FWUP_STATE_INSTALL_DATA_FLASH_ERASE_COMPLETE:
            case FWUP_STATE_BANK0_INSTALL_CODE_FLASH_ERASE_WAIT:
            case FWUP_STATE_BANK0_INSTALL_CODE_FLASH_ERASE_COMPLETE:
            case FWUP_STATE_BANK0_INSTALL_CODE_FLASH_READ_WAIT:
            case FWUP_STATE_BANK0_INSTALL_CODE_FLASH_READ_COMPLETE:
            case FWUP_STATE_BANK0_INSTALL_CODE_FLASH_WRITE_WAIT:
            case FWUP_STATE_BANK0_INSTALL_CODE_FLASH_WRITE_COMPLETE:
            case FWUP_STATE_BANK0_INSTALL_SET_BOOT_PROTECT:
            case FWUP_STATE_INSTALL_DATA_FLASH_READ_WAIT:
            case FWUP_STATE_INSTALL_DATA_FLASH_READ_COMPLETE:
            case FWUP_STATE_INSTALL_DATA_FLASH_WRITE_WAIT:
            case FWUP_STATE_INSTALL_DATA_FLASH_WRITE_COMPLETE:
            case FWUP_STATE_BANK0_UPDATE_CHECK:
            case FWUP_STATE_BANK1_UPDATE_CODE_FLASH_ERASE_WAIT:
            case FWUP_STATE_BANK1_UPDATE_CODE_FLASH_ERASE_COMPLETE:
            case FWUP_STATE_BANK1_UPDATE_DATA_AREA_ERASE:
            case FWUP_STATE_BANK1_UPDATE_DATA_AREA_ERASE_WAIT:
            case FWUP_STATE_BANK1_UPDATE_DATA_AREA_ERASE_COMPLETE:
            case FWUP_STATE_BANK1_UPDATE_DATA_AREA_COPY_WAIT:
            case FWUP_STATE_BANK1_UPDATE_DATA_AREA_COPY_COMPLETE:
            case FWUP_STATE_BANK1_UPDATE_COPY_FLAG_ERASE:
            case FWUP_STATE_BANK1_UPDATE_COPY_FLAG_ERASE_WAIT:
            case FWUP_STATE_BANK1_UPDATE_COPY_FLAG_ERASE_COMPLETE:
            case FWUP_STATE_BANK1_UPDATE_COPY_FLAG_WRITE_WAIT:
            case FWUP_STATE_BANK1_UPDATE_COPY_FLAG_WRITE_COMPLETE:
            case FWUP_STATE_EOL_BANK1_ERASE_WAIT:
            case FWUP_STATE_EOL_BANK1_ERASE_COMPLETE:
            case FWUP_STATE_EOL_BANK1_LIFECYCLE_WRITE_WAIT:
            case FWUP_STATE_EOL_BANK1_LIFECYCLE_WRITE_COMPLETE:
            case FWUP_STATE_EOL_DATA_FLASH_ERASE_WAIT:
            case FWUP_STATE_EOL_DATA_FLASH_ERASE_COMPLETE:
            case FWUP_STATE_FINALIZE:
                switch (sp_fwup_control_block_bank0->image_flag)
                {
                    case LIFECYCLE_STATE_BLANK:
                        switch (fwup_get_status())
                        {
                            case FWUP_STATE_BANK0_CHECK:
                                if (LIFECYCLE_STATE_BLANK == sp_fwup_control_block_bank1->image_flag)
                                {
                                    DEBUG_LOG("start installing user program.\r\n");
#if (FWUP_CFG_BOOT_PROTECT_ENABLE == 1)
                                    if (false == fwup_get_boot_protect())
                                    {
#if (FWUP_FLASH_BANK_MODE == 0) /* Dual mode */
                                        /* No Boot Protected */
                                        DEBUG_LOG("erase bank1 secure boot mirror area...");
                                        flash_api_error_code = fwup_flash_erase(BOOT_LOADER_MIRROR_ERASE_ADDRESS,
                                                BOOT_LOADER_MIRROR_BLOCK_NUMBER);
                                        if(FLASH_SUCCESS != flash_api_error_code)
                                        {
                                            DEBUG_LOG("NG\r\n");
                                            DEBUG_LOG2("R_FLASH_Erase() returns error code = %d.\r\n",
                                                    s_flash_error_code);
                                            fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                            secure_boot_error_code = FWUP_FAIL;
                                            break; // @suppress("Case break statement")
                                        }
                                        fwup_update_status(FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_WAIT);
                                    }
                                    else
                                    {
                                        /* Already Boot Protected */
                                        /* Skip boot copy process */
                                        DEBUG_LOG("boot protected: skip copy secure boot from bank0 to bank1...");
                                        s_flash_error_code = FLASH_SUCCESS;
                                        fwup_update_status(FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_COMPLETE);
#else /* Linear mode */
                                        /* No Boot Protected */
                                        /* Do not FLASH erase because the Bootloader is not copied */
                                        /* Skip to next status */
                                        fwup_update_status(FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_COMPLETE);
                                    }
                                    else
                                    {
                                        /* Already Boot Protected */
                                        /* Skip boot copy process */
                                        DEBUG_LOG("already boot protected.\r\n");
                                        s_flash_error_code = FLASH_SUCCESS;
                                        fwup_update_status(FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_COMPLETE);
#endif  /* (FWUP_FLASH_BANK_MODE == 0) */
                                    }
#else /* FWUP_CFG_BOOT_PROTECT_ENABLE == 1 */
#if (FWUP_FLASH_BANK_MODE == 0) /* Dual mode */
                                    DEBUG_LOG("erase bank1 secure boot mirror area...");
                                    flash_api_error_code
                                        = fwup_flash_erase((flash_block_address_t)BOOT_LOADER_MIRROR_ERASE_ADDRESS,
                                            (uint32_t)BOOT_LOADER_MIRROR_BLOCK_NUMBER);
                                    if (FLASH_SUCCESS != flash_api_error_code)
                                    {
                                        DEBUG_LOG("NG\r\n");
                                        DEBUG_LOG2("R_FLASH_Erase() returns error code = %d.\r\n", s_flash_error_code);
                                        fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                        secure_boot_error_code = FWUP_FAIL;
                                        break; // @suppress("Case break statement")
                                    }
#if (FLASH_CFG_DATA_FLASH_BGO == 1)
                                    fwup_update_status(FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_WAIT);
#else  /* (FLASH_CFG_DATA_FLASH_BGO == 0) */
                                    fwup_update_status(FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_COMPLETE);
#endif /* (FLASH_CFG_DATA_FLASH_BGO == 1) */
#else /* Linear mode */

                                    /* Do not FLASH erase because the Bootloader is not copied */
                                    /* Skip to next status */
                                    fwup_update_status(FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_COMPLETE);
#endif /* (FWUP_FLASH_BANK_MODE) */
#endif /* (FWUP_CFG_BOOT_PROTECT_ENABLE == 1) */
                                }
#if (FWUP_FLASH_BANK_MODE == 0) /* Dual mode */
                                else if (LIFECYCLE_STATE_VALID == sp_fwup_control_block_bank1->image_flag)
                                {
                                    DEBUG_LOG("bank0(current) is blank, but bank1(previous) is still alive.\r\n");
                                    DEBUG_LOG("swap bank...");
                                    R_BSP_SoftwareDelay(3000, BSP_DELAY_MILLISECS);
                                    bank_swap_with_software_reset();
                                    while (1)
                                    {
                                        ;
                                    }
                                }
#endif /* (FWUP_FLASH_BANK_MODE) */
                                else
                                {
                                    DEBUG_LOG("user program installation failed.\r\n");
                                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                    secure_boot_error_code = FWUP_FAIL;
                                }
                                break;

                            case FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_WAIT:

