vinh107108/amazon-freertos/projects/renesas/rx65n-rsk/e2studio/boot_loader/src/smc_gen/r_fwup/src/r_fwup_boot_loader.c
                                /* this state will be update by flash callback */
                                break;

                            case FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_COMPLETE:
                                if (LIFECYCLE_STATE_INSTALLING != sp_fwup_control_block_bank1->image_flag)
                                {
                                    if (FLASH_SUCCESS == s_flash_error_code)
                                    {
#if (FWUP_FLASH_BANK_MODE == 0) /* Dual mode */
                                        DEBUG_LOG("OK\r\n");
#endif /* (FWUP_FLASH_BANK_MODE) */
                                    }
                                    else
                                    {
                                        DEBUG_LOG2("R_FLASH_Erase() callback error. %d.\r\n", s_flash_error_code);
                                        DEBUG_LOG("system error.\r\n");
                                        fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                        secure_boot_error_code = FWUP_FAIL;
                                        break; // @suppress("Case break statement")
                                    }
                                }
#if (FWUP_FLASH_BANK_MODE == 0) /* Dual mode */
                                DEBUG_LOG("copy secure boot from bank0 to bank1...");

                                flash_api_error_code = fwup_flash_write((uint32_t)BOOT_LOADER_LOW_ADDRESS,
                                    (uint32_t)BOOT_LOADER_MIRROR_LOW_ADDRESS,
                                    BOOT_LOADER_PGM_SIZE);
                                if (FLASH_SUCCESS != flash_api_error_code)
                                {
                                    DEBUG_LOG("NG\r\n");
                                    DEBUG_LOG2("R_FLASH_Write() returns error code = %d.\r\n", s_flash_error_code);
                                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                    secure_boot_error_code = FWUP_FAIL;
                                    break; // @suppress("Case break statement")
                                }
#if (FLASH_CFG_DATA_FLASH_BGO == 1)
                                fwup_update_status(FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_WAIT);
#else  /* (FLASH_CFG_DATA_FLASH_BGO == 0) */
                                fwup_update_status(FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_COMPLETE);
#endif /* (FLASH_CFG_DATA_FLASH_BGO == 1) */

#else /* Linear mode */
                                /* Do not FLASH write because the Bootloader is not copied */
                                /* Skip to next status */
                                fwup_update_status(FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_COMPLETE);
#endif /* (FWUP_FLASH_BANK_MODE) */
                                break;

                            case FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_WAIT:

                                /* this state will be update by flash callback */
                                break;

                            case FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_COMPLETE:
                                if (FLASH_SUCCESS == s_flash_error_code)
                                {
#if (FWUP_FLASH_BANK_MODE == 0) /* Dual mode */
                                    DEBUG_LOG("OK\r\n");
#endif /* (FWUP_FLASH_BANK_MODE) */
                                }
                                else
                                {
                                    DEBUG_LOG2("R_FLASH_Write() callback error. %d.\r\n", s_flash_error_code);
                                    DEBUG_LOG("system error.\r\n");
                                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                    secure_boot_error_code = FWUP_FAIL;
                                    break; // @suppress("Case break statement")
                                }
#if (FWUP_CFG_BOOT_PROTECT_ENABLE == 1)
                                if (false == fwup_get_boot_protect())
                                {
                                    flash_api_error_code = fwup_set_boot_protect();
                                    if (FLASH_SUCCESS != flash_api_error_code)
                                    {
                                        DEBUG_LOG2("R_FLASH_Control() returns error. %d.\r\n", flash_api_error_code);
                                        DEBUG_LOG("system error.\r\n");
                                        fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                        secure_boot_error_code = FWUP_FAIL;
                                        break; // @suppress("Case break statement")
                                    }
                                    else
                                    {
                                        DEBUG_LOG("set boot protect.\r\n");
                                    }
                                }
#endif

                                DEBUG_LOG("========== install user program phase ==========\r\n");
#if (FWUP_CFG_OTA_DATA_STORAGE == 1)
                                DEBUG_LOG("erase install area (data area on code flash ): ");
#else  /* (FWUP_CFG_OTA_DATA_STORAGE == 0) */
                                DEBUG_LOG("erase install area (data flash): ");
#endif  /* FWUP_CFG_OTA_DATA_STORAGE */
                                flash_api_error_code = fwup_flash_erase(
                                        (flash_block_address_t) BOOT_LOADER_USER_CONST_DATA_LOW_ADDRESS,
                                        BOOT_LOADER_UPDATE_CONST_DATA_TARGET_BLOCK_NUMBER);
                                if (FLASH_SUCCESS != flash_api_error_code)
                                {
                                    DEBUG_LOG2("R_FLASH_Erase() returns error. %d.\r\n", s_flash_error_code);
                                    DEBUG_LOG("system error.\r\n");
                                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                    secure_boot_error_code = FWUP_FAIL;
                                    break; // @suppress("Case break statement")
                                }

