vinh107108/amazon-freertos/projects/renesas/rx65n-rsk/e2studio/boot_loader/src/smc_gen/r_fwup/src/r_fwup_boot_loader.c
#if (FLASH_CFG_DATA_FLASH_BGO == 1)
                                fwup_update_status(FWUP_STATE_INSTALL_DATA_FLASH_ERASE_WAIT);
#else  /* (FLASH_CFG_DATA_FLASH_BGO == 0) */
                                fwup_update_status(FWUP_STATE_INSTALL_DATA_FLASH_ERASE_COMPLETE);
#endif  /* FLASH_CFG_DATA_FLASH_BGO */
                                break;

                            case FWUP_STATE_INSTALL_DATA_FLASH_ERASE_WAIT:

                                /* this state will be update by flash callback */
                                break;

                            case FWUP_STATE_INSTALL_DATA_FLASH_ERASE_COMPLETE:
                                if (FLASH_SUCCESS == s_flash_error_code)
                                {
                                    DEBUG_LOG("OK\r\n");
                                }
                                else
                                {
                                    DEBUG_LOG2("R_FLASH_Write() callback error. %d.\r\n", s_flash_error_code);
                                    DEBUG_LOG("system error.\r\n");
                                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                    secure_boot_error_code = FWUP_FAIL;
                                    break; // @suppress("Case break statement")
                                }
                                DEBUG_LOG("erase install area (code flash): ");
                                flash_api_error_code = fwup_flash_erase(
                                    (flash_block_address_t)BOOT_LOADER_UPDATE_TEMPORARY_AREA_ERASE_ADDRESS,
                                    BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER);
                                if (FLASH_SUCCESS != flash_api_error_code)
                                {
                                    DEBUG_LOG2("R_FLASH_Erase() returns error. %d.\r\n", s_flash_error_code);
                                    DEBUG_LOG("system error.\r\n");
                                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                    secure_boot_error_code = FWUP_FAIL;
                                    break; // @suppress("Case break statement")
                                }
#if (FLASH_CFG_CODE_FLASH_BGO == 1)
                                fwup_update_status(FWUP_STATE_BANK0_INSTALL_CODE_FLASH_ERASE_WAIT);
#else /* (FLASH_CFG_CODE_FLASH_BGO == 0) */
                                fwup_update_status(FWUP_STATE_BANK0_INSTALL_CODE_FLASH_ERASE_COMPLETE);
#endif  /* FLASH_CFG_CODE_FLASH_BGO == 1 */
                                break;

                            case FWUP_STATE_BANK0_INSTALL_CODE_FLASH_ERASE_WAIT:
                                /* this state will be update by flash callback */
                                break;

                            case FWUP_STATE_BANK0_INSTALL_CODE_FLASH_ERASE_COMPLETE:
                                if (FLASH_SUCCESS == s_flash_error_code)
                                {
                                    DEBUG_LOG("OK\r\n");
                                }
                                else
                                {
                                    DEBUG_LOG2("R_FLASH_Write() callback error. %d.\r\n", s_flash_error_code);
                                    DEBUG_LOG("system error.\r\n");
                                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                    secure_boot_error_code = FWUP_FAIL;
                                    break; // @suppress("Case break statement")
                                }
                                s_sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_A].buffer_full_flag =
                                        BOOT_LOADER_SCI_RECEIVE_BUFFER_EMPTY;
                                s_sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_B].buffer_full_flag =
                                        BOOT_LOADER_SCI_RECEIVE_BUFFER_EMPTY;
                                s_sci_receive_control_block.p_sci_buffer_control =
                                        &s_sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_A];
                                s_sci_receive_control_block.current_state = BOOT_LOADER_SCI_CONTROL_BLOCK_A;
                                DEBUG_LOG2("send \"%s\" via UART.\r\n", INITIAL_FIRMWARE_FILE_NAME);
                                fwup_update_status(FWUP_STATE_BANK0_INSTALL_CODE_FLASH_READ_WAIT);
                                break;

                            case FWUP_STATE_BANK0_INSTALL_CODE_FLASH_READ_WAIT:

                                /* install code flash area */
                                if ( !firm_block_read(s_load_fw_control_block.flash_buffer,
                                        s_load_fw_control_block.offset))
                                {
                                    flash_api_error_code = fwup_flash_write(
                                            (uint32_t) s_load_fw_control_block.flash_buffer,
                                            (uint32_t) BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS
                                                    + s_load_fw_control_block.offset,
                                            sizeof(s_load_fw_control_block.flash_buffer));
                                    if (FLASH_SUCCESS != flash_api_error_code)
                                    {
                                        DEBUG_LOG2("R_FLASH_Write() returns error. %d.\r\n", s_flash_error_code);
                                        DEBUG_LOG("system error.\r\n");
                                        fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                        secure_boot_error_code = FWUP_FAIL;
                                        break; // @suppress("Case break statement")
                                    }
#if (FLASH_CFG_CODE_FLASH_BGO == 1)
                                    fwup_update_status(FWUP_STATE_BANK0_INSTALL_CODE_FLASH_WRITE_WAIT);
#else /* FLASH_CFG_CODE_FLASH_BGO == 0 */
                                    fwup_update_status(FWUP_STATE_BANK0_INSTALL_CODE_FLASH_WRITE_COMPLETE);
#endif  /* FLASH_CFG_CODE_FLASH_BGO */
                                }
                                break;

                            case FWUP_STATE_BANK0_INSTALL_CODE_FLASH_WRITE_WAIT:
                                /* this state will be update by flash callback */
                                break;

                            case FWUP_STATE_BANK0_INSTALL_CODE_FLASH_WRITE_COMPLETE:
                                if (FLASH_SUCCESS != s_flash_error_code)
                                {
                                    DEBUG_LOG2("R_FLASH_Write() callback error. %d.\r\n", s_flash_error_code);
                                    DEBUG_LOG("system error.\r\n");
                                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                    secure_boot_error_code = FWUP_FAIL;
                                    break;
                                }

                                s_load_fw_control_block.offset += FWUP_WRITE_BLOCK_SIZE;
                                s_load_fw_control_block.progress =
                                        (uint32_t) (((float) ((s_load_fw_control_block.offset)
                                                / (float) ((BOOT_LOADER_FLASH_CF_BLOCK_SIZE
                                                        * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER))) * 100));
                                DEBUG_LOG2("installing firmware...%u%%(%d/%dKB).\r",
                                        s_load_fw_control_block.progress,
                                        s_load_fw_control_block.offset / 1024,
                                        (BOOT_LOADER_FLASH_CF_BLOCK_SIZE *
                                                BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER / 1024));
                                if (s_load_fw_control_block.offset
                                        < (BOOT_LOADER_FLASH_CF_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER))
                                {

                                    /* one more loop */
                                    fwup_update_status(FWUP_STATE_BANK0_INSTALL_CODE_FLASH_READ_WAIT);
                                }
                                else if ((BOOT_LOADER_FLASH_CF_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER) ==
                                    s_load_fw_control_block.offset)
                                {
                                    DEBUG_LOG("\n");
                                    DEBUG_LOG("completed installing firmware.\r\n");
                                    s_load_const_data_control_block.offset = 0;
                                    fwup_update_status(FWUP_STATE_INSTALL_DATA_FLASH_READ_WAIT);
                                }
                                else
                                {
                                    DEBUG_LOG("\n");
                                    DEBUG_LOG("fatal error occurred.\r\n");
                                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                    secure_boot_error_code = FWUP_FAIL;
                                }
                                break;

