vinh107108/amazon-freertos/projects/renesas/rx65n-rsk/e2studio/boot_loader/src/smc_gen/r_fwup/src/r_fwup_boot_loader.c
                            case FWUP_STATE_INSTALL_DATA_FLASH_READ_WAIT:

                                /* install data flash area */
                                if ( !const_data_block_read(s_load_const_data_control_block.flash_buffer,
                                        s_load_const_data_control_block.offset))
                                {
                                    fwup_update_status(FWUP_STATE_INSTALL_DATA_FLASH_READ_COMPLETE);
                                }
                                break;

                            case FWUP_STATE_INSTALL_DATA_FLASH_READ_COMPLETE:
                                flash_api_error_code =
                                    fwup_flash_write((uint32_t)&s_load_const_data_control_block.flash_buffer
                                                                [(s_load_const_data_control_block.offset % 1024) / 4],
                                                    (uint32_t)BOOT_LOADER_USER_CONST_DATA_LOW_ADDRESS +
                                                    s_load_const_data_control_block.offset, FWUP_WRITE_BLOCK_SIZE);
                                if (FLASH_SUCCESS != flash_api_error_code)
                                {
                                    DEBUG_LOG2("R_FLASH_Write() returns error. %d.\r\n", s_flash_error_code);
                                    DEBUG_LOG("system error.\r\n");
                                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                    secure_boot_error_code = FWUP_FAIL;
                                    break;
                                }
#if (FLASH_CFG_DATA_FLASH_BGO == 1)
                                fwup_update_status(FWUP_STATE_INSTALL_DATA_FLASH_WRITE_WAIT);
#else /* (FLASH_CFG_DATA_FLASH_BGO == 0) */
                                fwup_update_status(FWUP_STATE_INSTALL_DATA_FLASH_WRITE_COMPLETE);
#endif  /* (FLASH_CFG_DATA_FLASH_BGO == 1) */
                                break;

                            case FWUP_STATE_INSTALL_DATA_FLASH_WRITE_WAIT:

                                /* this state will be update by flash callback */
                                break;

                            case FWUP_STATE_INSTALL_DATA_FLASH_WRITE_COMPLETE:
                                if (FLASH_SUCCESS != s_flash_error_code)
                                {
                                    DEBUG_LOG2("R_FLASH_Write() callback error. %d.\r\n", s_flash_error_code);
                                    DEBUG_LOG("system error.\r\n");
                                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                    secure_boot_error_code = FWUP_FAIL;
                                    break; // @suppress("Case break statement")
                                }

                                s_load_const_data_control_block.offset += FWUP_WRITE_BLOCK_SIZE;
                                s_load_const_data_control_block.progress =
                                        (uint32_t) (((float) ((s_load_const_data_control_block.offset)
                                                / (float) (BSP_DATA_FLASH_SIZE_BYTES)) * 100));
                                static uint32_t s_previous_offset = 0;
                                if ((s_load_const_data_control_block.offset / 1024) != s_previous_offset)
                                {
                                    DEBUG_LOG2("installing const data...%u%%(%d/%dKB).\r",
                                            s_load_const_data_control_block.progress,
                                            s_load_const_data_control_block.offset / 1024,
                                            BSP_DATA_FLASH_SIZE_BYTES/1024);
                                    s_previous_offset = s_load_const_data_control_block.offset / 1024;

                                    if (BSP_DATA_FLASH_SIZE_BYTES ==
                                        s_load_const_data_control_block.offset)
                                    {
                                        DEBUG_LOG("\n");
                                        DEBUG_LOG("completed installing const data.\r\n");

                                        DEBUG_LOG2("integrity check scheme = %-.32s\r\n",
                                                sp_fwup_control_block_bank1->signature_type);
                                        DEBUG_LOG("bank1(temporary area) on code flash integrity check...");

                                        /* Firmware verification for the signature type. */
                                        if (!strcmp((const char *)sp_fwup_control_block_bank1->signature_type,
                                                INTEGRITY_CHECK_SCHEME_HASH_SHA256_STANDALONE))
                                        {
                                            uint8_t hash_sha256[TC_SHA256_DIGEST_SIZE];

                                            /* Hash message */
                                            struct tc_sha256_state_struct x_ctx;
                                            tc_sha256_init( &x_ctx);
                                            tc_sha256_update( &x_ctx,
                                                    (uint8_t*) BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS
                                                            + BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH,
                                                    (BOOT_LOADER_FLASH_CF_BLOCK_SIZE
                                                            * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER)
                                                            - BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH);
                                            tc_sha256_final(hash_sha256, &x_ctx);
                                            verification_result = memcmp(sp_fwup_control_block_bank1->signature,
                                                    hash_sha256, sizeof(hash_sha256));
                                        }
                                        else if (!strcmp((const char *)sp_fwup_control_block_bank1->signature_type,
                                                INTEGRITY_CHECK_SCHEME_SIG_SHA256_ECDSA_STANDALONE))
                                        {
                                            verification_result = fwup_verification_sha256_ecdsa(
                                                    (const uint8_t *) BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS
                                                            + BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH,
                                                    (BOOT_LOADER_FLASH_CF_BLOCK_SIZE
                                                            * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER)
                                                            - BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH,
                                                    sp_fwup_control_block_bank1->signature,
                                                    sp_fwup_control_block_bank1->signature_size);
                                        }
                                        else
                                        {
                                            verification_result = -1;
                                        }

