vinh107108/amazon-freertos/projects/renesas/rx65n-rsk/e2studio/boot_loader/src/smc_gen/r_fwup/src/r_fwup_boot_loader.c
                                        if (0 == verification_result)
                                        {
                                            DEBUG_LOG("OK\r\n");
                                            s_load_const_data_control_block.offset = 0;
                                            DEBUG_LOG("software reset...\r\n");
                                            R_BSP_SoftwareDelay(3000, BSP_DELAY_MILLISECS);
                                            software_reset();
                                        }
                                        else
                                        {
                                            DEBUG_LOG("NG\r\n");
                                            fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                            secure_boot_error_code = FWUP_FAIL;
                                        }

                                    }
                                    else
                                    {
                                        fwup_update_status(FWUP_STATE_INSTALL_DATA_FLASH_READ_WAIT);
                                    }
                                }
                                else if (s_load_const_data_control_block.offset < (BSP_DATA_FLASH_SIZE_BYTES))
                                {

                                    /* one more loop */
                                    fwup_update_status(FWUP_STATE_INSTALL_DATA_FLASH_READ_COMPLETE);
                                }
                                else
                                {
                                    DEBUG_LOG("\n");
                                    DEBUG_LOG("fatal error occurred.\r\n");
                                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                    secure_boot_error_code = FWUP_FAIL;
                                }
                                break;
                            default:
                                break;
                        }
                    break;
                    case LIFECYCLE_STATE_TESTING:
                        DEBUG_LOG("illegal status\r\n");
                        DEBUG_LOG("swap bank...");
                        R_BSP_SoftwareDelay(3000, BSP_DELAY_MILLISECS);
                        bank_swap_with_software_reset();
                        while (1)
                        {
                            ;
                        }
                        break;

                    case LIFECYCLE_STATE_INSTALLING:
                        switch (fwup_get_status())
                        {
                            case FWUP_STATE_BANK0_CHECK:
                                DEBUG_LOG2("integrity check scheme = %-.32s\r\n",
                                        sp_fwup_control_block_bank0->signature_type);
                                DEBUG_LOG("bank0(execute area) on code flash integrity check...");

                                /* Firmware verification for the signature type. */
                                if (!strcmp((const char *)sp_fwup_control_block_bank0->signature_type,
                                        INTEGRITY_CHECK_SCHEME_HASH_SHA256_STANDALONE))
                                {

                                    /* Hash message */
                                    uint8_t hash_sha256[TC_SHA256_DIGEST_SIZE];
                                    struct tc_sha256_state_struct x_ctx;
                                    tc_sha256_init( &x_ctx);
                                    tc_sha256_update( &x_ctx,
                                            (uint8_t*) BOOT_LOADER_UPDATE_EXECUTE_AREA_LOW_ADDRESS
                                                    + BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH,
                                            (BOOT_LOADER_FLASH_CF_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER)
                                                    - BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH);
                                    tc_sha256_final(hash_sha256, &x_ctx);
                                    verification_result = memcmp(sp_fwup_control_block_bank0->signature,
                                            hash_sha256, sizeof(hash_sha256));
                                }
                                else if (!strcmp((const char *)sp_fwup_control_block_bank0->signature_type,
                                        INTEGRITY_CHECK_SCHEME_SIG_SHA256_ECDSA_STANDALONE))
                                {
                                    verification_result = fwup_verification_sha256_ecdsa(
                                            (const uint8_t*) BOOT_LOADER_UPDATE_EXECUTE_AREA_LOW_ADDRESS
                                                    + BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH,
                                            (BOOT_LOADER_FLASH_CF_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER)
                                                    - BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH,
                                            sp_fwup_control_block_bank0->signature,
                                            sp_fwup_control_block_bank0->signature_size);
                                }
                                else
                                {
                                    verification_result = -1;
                                }

                                if (0 == verification_result)
                                {
                                    DEBUG_LOG("OK\r\n");

                                    /* CODE CHECKER, this is OK as a comment precedes the cast. */
                                    if (!strncmp((const char *)sp_boot_loader_magic_code,
                                            BOOT_LOADER_MAGIC_CODE, BOOT_LOADER_MAGIC_CODE_LENGTH))
                                    {
                                        fwup_update_status(FWUP_STATE_BANK0_INSTALL_SET_BOOT_PROTECT);
                                    }
                                    else
                                    {
#if (FWUP_CFG_BOOT_PROTECT_ENABLE == 1)
                                        if (false == fwup_get_boot_protect())
                                        {
                                            /* No Boot Protected */
#if (FWUP_FLASH_BANK_MODE == 0) // Dual mode
                                            DEBUG_LOG("erase bank1 secure boot mirror area...");
                                            flash_api_error_code =
                                                fwup_flash_erase(BOOT_LOADER_MIRROR_ERASE_ADDRESS,
                                                            BOOT_LOADER_MIRROR_BLOCK_NUMBER);
                                            if(FLASH_SUCCESS != flash_api_error_code)
                                            {
                                                DEBUG_LOG("NG\r\n");
                                                DEBUG_LOG2("R_FLASH_Erase() returns error code = %d.\r\n",
                                                    s_flash_error_code);
                                                fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                                secure_boot_error_code = FWUP_FAIL;
                                                break; // @suppress("Case break statement")
                                            }
                                            fwup_update_status(FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_WAIT);
#else /* Linear mode */
                                            /* Do not FLASH erase because the Bootloader is not copied */
                                            /* Skip to next status */
                                            fwup_update_status(FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_COMPLETE);
#endif  /* FWUP_FLASH_BANK_MODE */
                                        }
                                        else
                                        {
                                            /* Already Boot Protected */
                                            /* Skip boot copy process */
                                            DEBUG_LOG("already boot protected.\r\n");
                                            s_flash_error_code = FLASH_SUCCESS;
                                            fwup_update_status(FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_COMPLETE);
                                        }
#else /* FWUP_CFG_BOOT_PROTECT_ENABLE == 1 */
#if (FWUP_FLASH_BANK_MODE == 0) /* Dual mode */
                                        DEBUG_LOG("erase bank1 secure boot mirror area...");
                                        flash_api_error_code
                                            = fwup_flash_erase((flash_block_address_t)BOOT_LOADER_MIRROR_ERASE_ADDRESS,
                                                    (uint32_t)BOOT_LOADER_MIRROR_BLOCK_NUMBER);
                                        if (FLASH_SUCCESS != flash_api_error_code)
                                        {
                                            DEBUG_LOG("NG\r\n");
                                            DEBUG_LOG2("R_FLASH_Erase() returns error code = %d.\r\n",
                                                    s_flash_error_code);
                                            fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                            secure_boot_error_code = FWUP_FAIL;
                                            break; // @suppress("Case break statement")
                                        }
                                        fwup_update_status(FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_WAIT);
#else /* Linear mode */
                                        /* Do not FLASH erase because the Bootloader is not copied */
                                        /* Skip to next status */
                                        fwup_update_status(FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_COMPLETE);
#endif  /* FWUP_FLASH_BANK_MODE */
#endif  /* (FWUP_CFG_BOOT_PROTECT_ENABLE == 1) */
                                    }
                                }
                                else
                                {
                                    DEBUG_LOG("NG.\r\n");
                                    DEBUG_LOG("Code flash is completely broken.\r\n");
                                    DEBUG_LOG("Please erase all code flash.\r\n");
                                    DEBUG_LOG("And, write secure boot using debugger.\r\n");
                                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                    secure_boot_error_code = FWUP_FAIL;
                                }
                                break;

                            case FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_WAIT:

