vinh107108/amazon-freertos/projects/renesas/rx65n-rsk/e2studio/boot_loader/src/smc_gen/r_fwup/src/r_fwup_boot_loader.c
                                if (FLASH_SUCCESS != flash_api_error_code)
                                {
                                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                    secure_boot_error_code = FWUP_FAIL;
                                }
                                break;
#endif /* FWUP_CFG_OTA_DATA_STORAGE == 1 */

                            case FWUP_STATE_FINALIZE:
                                DEBUG_LOG("jump to user program\r\n");
                                R_BSP_SoftwareDelay(1000, BSP_DELAY_MILLISECS);
                                secure_boot_error_code = FWUP_SUCCESS;
                                break;

                            default:
                                break;
                        }
                        break;
                    case LIFECYCLE_STATE_VALID:
                        switch (fwup_get_status())
                        {
                            case FWUP_STATE_BANK0_UPDATE_CHECK:
                                DEBUG_LOG2("integrity check scheme = %-.32s\r\n",
                                        sp_fwup_control_block_bank0->signature_type);
                                DEBUG_LOG("bank0(execute area) on code flash integrity check...");

                                /* Firmware verification for the signature type. */
                                if (!strcmp((const char*)sp_fwup_control_block_bank0->signature_type,
                                        INTEGRITY_CHECK_SCHEME_HASH_SHA256_STANDALONE))
                                {

                                    /* Hash message */
                                    uint8_t hash_sha256[TC_SHA256_DIGEST_SIZE];
                                    struct tc_sha256_state_struct x_ctx;
                                    tc_sha256_init( &x_ctx);
                                    tc_sha256_update( &x_ctx,
                                            (uint8_t*) BOOT_LOADER_UPDATE_EXECUTE_AREA_LOW_ADDRESS
                                                    + BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH,
                                            (BOOT_LOADER_FLASH_CF_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER)
                                                    - BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH);
                                    tc_sha256_final(hash_sha256, &x_ctx);
                                    verification_result = memcmp(sp_fwup_control_block_bank0->signature,
                                            hash_sha256, sizeof(hash_sha256));
                                }
                                else if (!strcmp((const char*)sp_fwup_control_block_bank0->signature_type,
                                        INTEGRITY_CHECK_SCHEME_SIG_SHA256_ECDSA_STANDALONE))
                                {
                                    verification_result = fwup_verification_sha256_ecdsa(
                                            (const uint8_t*) BOOT_LOADER_UPDATE_EXECUTE_AREA_LOW_ADDRESS
                                                    + BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH,
                                            (BOOT_LOADER_FLASH_CF_BLOCK_SIZE * BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER)
                                                    - BOOT_LOADER_USER_FIRMWARE_HEADER_LENGTH,
                                            sp_fwup_control_block_bank0->signature,
                                            sp_fwup_control_block_bank0->signature_size);
                                }
                                else
                                {
                                    verification_result = -1;
                                }

                                if (0 == verification_result)
                                {
                                    DEBUG_LOG("OK\r\n");

#if (FWUP_CFG_OTA_DATA_STORAGE == 1)
                                    s_last_image_flag = sp_fwup_control_block_bank1->image_flag; /* Keep bank1 image_flag */
#endif /* FWUP_CFG_OTA_DATA_STORAGE == 1 */
                                    if (LIFECYCLE_STATE_BLANK != sp_fwup_control_block_bank1->image_flag)
                                    {
                                        DEBUG_LOG("erase install area (code flash): ");
                                        flash_api_error_code = fwup_flash_erase(
                                                (flash_block_address_t) BOOT_LOADER_UPDATE_TEMPORARY_AREA_ERASE_ADDRESS,
                                                BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER);
                                        if (FLASH_SUCCESS != flash_api_error_code)
                                        {
                                            DEBUG_LOG2("R_FLASH_Erase() returns error. %d.\r\n", s_flash_error_code);
                                            DEBUG_LOG("system error.\r\n");
                                            fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                            secure_boot_error_code = FWUP_FAIL;
                                            break; // @suppress("Case break statement")
                                        }
#if (FLASH_CFG_CODE_FLASH_BGO == 1)
                                        fwup_update_status(FWUP_STATE_BANK1_UPDATE_CODE_FLASH_ERASE_WAIT);
#else /* (FLASH_CFG_CODE_FLASH_BGO == 0) */
                                        fwup_update_status(FWUP_STATE_BANK1_UPDATE_CODE_FLASH_ERASE_COMPLETE);
#endif  /* FLASH_CFG_CODE_FLASH_BGO == 1 */
                                    }
                                    else
                                    {
#if (FWUP_CFG_OTA_DATA_STORAGE == 0)
                                        fwup_update_status(FWUP_STATE_FINALIZE);
#else /* FWUP_CFG_OTA_DATA_STORAGE == 1 */
                                        fwup_update_status(FWUP_STATE_BANK1_UPDATE_DATA_AREA_ERASE);
#endif /* FWUP_CFG_OTA_DATA_STORAGE */
                                    }
                                }
                                else
                                {
                                    DEBUG_LOG("NG.\r\n");
                                    DEBUG_LOG("Code flash is completely broken.\r\n");
                                    DEBUG_LOG("Please erase all code flash.\r\n");
                                    DEBUG_LOG("And, write secure boot using debugger.\r\n");
                                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                    secure_boot_error_code = FWUP_FAIL;
                                }
                                break;

                            case FWUP_STATE_BANK1_UPDATE_CODE_FLASH_ERASE_WAIT:
                                /* this state will be update by flash callback */
                                break;

