vinh107108/amazon-freertos/projects/renesas/rx65n-rsk/e2studio/boot_loader/src/smc_gen/r_fwup/src/r_fwup_boot_loader.c
                            case FWUP_STATE_BANK1_UPDATE_CODE_FLASH_ERASE_COMPLETE:
                                if (FLASH_SUCCESS == s_flash_error_code)
                                {
                                    DEBUG_LOG("OK\r\n");
#if (FWUP_CFG_OTA_DATA_STORAGE == 0)
                                    fwup_update_status(FWUP_STATE_FINALIZE);
#else /* FWUP_CFG_OTA_DATA_STORAGE == 1 */
                                    fwup_update_status(FWUP_STATE_BANK1_UPDATE_DATA_AREA_ERASE);
#endif /* FWUP_CFG_OTA_DATA_STORAGE */
                                }
                                else
                                {
                                    DEBUG_LOG2("R_FLASH_Erase() callback error. %d.\r\n", s_flash_error_code);
                                    DEBUG_LOG("system error.\r\n");
                                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                    secure_boot_error_code = FWUP_FAIL;
                                }

                                break;

#if (FWUP_CFG_OTA_DATA_STORAGE == 1)
                            case FWUP_STATE_BANK1_UPDATE_DATA_AREA_ERASE:
                                if (LIFECYCLE_STATE_BLANK == s_last_image_flag)
                                {
                                    if (FWUP_COPY_FLAG_ON != sp_fwup_control_block_bank1->data_copy_flag)
                                    {
                                        do_copy_flag = true;
                                    }
                                }
                                else if (LIFECYCLE_STATE_INVALID != s_last_image_flag)
                                {
                                    do_copy_flag = true;
                                }
                                else
                                {
                                    R_BSP_NOP();
                                }

                                if (true == do_copy_flag)
                                {
                                    /* Copy data Execute area to Temporary area */
                                    flash_api_error_code = s_copy_data_area();

                                    if (FLASH_SUCCESS != flash_api_error_code)
                                    {
                                        fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                        secure_boot_error_code = FWUP_FAIL;
                                    }
                                }
                                else
                                {
                                    fwup_update_status(FWUP_STATE_FINALIZE);
                                }
                                break;

                            case FWUP_STATE_BANK1_UPDATE_DATA_AREA_ERASE_WAIT:
                            case FWUP_STATE_BANK1_UPDATE_DATA_AREA_ERASE_COMPLETE:
                            case FWUP_STATE_BANK1_UPDATE_DATA_AREA_COPY_WAIT:
                            case FWUP_STATE_BANK1_UPDATE_DATA_AREA_COPY_COMPLETE:
                                /* Copy data from Execute area to Temporary area */
                                flash_api_error_code = s_copy_data_area();

                                if (FLASH_SUCCESS != flash_api_error_code)
                                {
                                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                    secure_boot_error_code = FWUP_FAIL;
                                }
                                break;

                            case FWUP_STATE_BANK1_UPDATE_COPY_FLAG_ERASE:
                            case FWUP_STATE_BANK1_UPDATE_COPY_FLAG_ERASE_WAIT:
                            case FWUP_STATE_BANK1_UPDATE_COPY_FLAG_ERASE_COMPLETE:
                            case FWUP_STATE_BANK1_UPDATE_COPY_FLAG_WRITE_WAIT:
                            case FWUP_STATE_BANK1_UPDATE_COPY_FLAG_WRITE_COMPLETE:
                                /* set data_copy_flag */
                                flash_api_error_code = s_set_copy_flag();

                                if (FLASH_SUCCESS != flash_api_error_code)
                                {
                                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                    secure_boot_error_code = FWUP_FAIL;
                                }
                                break;
#endif /* FWUP_CFG_OTA_DATA_STORAGE == 1 */

                            case FWUP_STATE_FINALIZE:
                                DEBUG_LOG("jump to user program\r\n");
                                R_BSP_SoftwareDelay(1000, BSP_DELAY_MILLISECS);
                                secure_boot_error_code = FWUP_SUCCESS;
                                break;

                            default:
                                break;
                        }
                        break;
                    case LIFECYCLE_STATE_EOL:
                        switch (fwup_get_status())
                        {
                            case FWUP_STATE_BANK0_CHECK:
                                if (LIFECYCLE_STATE_EOL == sp_fwup_control_block_bank1->image_flag)
                                {

                                    /* The status of bank1 is already EOL */
                                    DEBUG_LOG("check bank1 status: ");
                                    s_flash_error_code = FLASH_SUCCESS;
                                    fwup_update_status(FWUP_STATE_EOL_DATA_FLASH_ERASE_COMPLETE);
                                }
                                else
                                {

                                    /* The status of bank1 is NOT EOL */
                                    DEBUG_LOG("erase install area (code flash): ");
                                    flash_api_error_code = fwup_flash_erase(
                                            (flash_block_address_t) BOOT_LOADER_UPDATE_TEMPORARY_AREA_ERASE_ADDRESS,
                                            BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER);
                                    if (FLASH_SUCCESS != flash_api_error_code)
                                    {
                                        DEBUG_LOG("NG.\r\n");
                                        DEBUG_LOG2("R_FLASH_Erase() returns error. %d.\r\n", s_flash_error_code);
                                        DEBUG_LOG("system error.\r\n");
                                        fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                        secure_boot_error_code = FWUP_FAIL;
                                        break;
                                    }
#if (FLASH_CFG_CODE_FLASH_BGO == 1)
                                    fwup_update_status(FWUP_STATE_EOL_BANK1_ERASE_WAIT);
#else
                                    fwup_update_status(FWUP_STATE_EOL_BANK1_ERASE_COMPLETE);
#endif  /* (FLASH_CFG_CODE_FLASH_BGO == 1) */
                                }
                            break;

                            case FWUP_STATE_EOL_BANK1_ERASE_WAIT:
                                /* this state will be update by flash callback */
                            break;

                            case FWUP_STATE_EOL_BANK1_ERASE_COMPLETE:
                                if (FLASH_SUCCESS == s_flash_error_code)
                                {
                                    DEBUG_LOG("OK\r\n");
                                }
                                else
                                {
                                    DEBUG_LOG("NG.\r\n");
                                    DEBUG_LOG2("R_FLASH_Erase() callback error. %d.\r\n", s_flash_error_code);
                                    DEBUG_LOG("system error.\r\n");
                                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                    secure_boot_error_code = FWUP_FAIL;
                                    break;
                                }

                                /* CODE CHECKER, this is OK as a comment precedes the cast. */
                                memcpy(s_block_buffer, (void*)BOOT_LOADER_UPDATE_EXECUTE_AREA_LOW_ADDRESS,
                                        BOOT_LOADER_FLASH_CF_BLOCK_SIZE);

