vinh107108/amazon-freertos/projects/renesas/rx65n-rsk/e2studio/boot_loader/src/smc_gen/r_fwup/src/r_fwup_boot_loader.c
                                p_fwup_control_block_tmp->image_flag = LIFECYCLE_STATE_EOL;
                                DEBUG_LOG2("update LIFECYCLE_STATE from [%s] to [%s]\r\n",
                                        get_status_string(sp_fwup_control_block_bank1->image_flag),
                                        get_status_string(p_fwup_control_block_tmp->image_flag));
                                DEBUG_LOG("bank1(temporary area) block0 write (to update LIFECYCLE_STATE)...");
                                flash_api_error_code = fwup_flash_write((uint32_t) p_fwup_control_block_tmp,
                                        (uint32_t) BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS,
                                        BOOT_LOADER_FLASH_CF_BLOCK_SIZE);
                                if (FLASH_SUCCESS != flash_api_error_code)
                                {
                                    DEBUG_LOG2("R_FLASH_Write() returns error. %d.\r\n", s_flash_error_code);
                                    DEBUG_LOG("system error.\r\n");
                                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                    secure_boot_error_code = FWUP_FAIL;
                                    break;
                                }
#if (FLASH_CFG_CODE_FLASH_BGO == 1)
                                fwup_update_status(FWUP_STATE_EOL_BANK1_LIFECYCLE_WRITE_WAIT);
#else /* (FLASH_CFG_CODE_FLASH_BGO == 0) */
                                fwup_update_status(FWUP_STATE_EOL_BANK1_LIFECYCLE_WRITE_COMPLETE);
#endif  /* (FLASH_CFG_CODE_FLASH_BGO == 1) */
                            break;

                            case FWUP_STATE_EOL_BANK1_LIFECYCLE_WRITE_WAIT:
                                /* this state will be update by flash callback */
                            break;

                            case FWUP_STATE_EOL_BANK1_LIFECYCLE_WRITE_COMPLETE:
                                if (FLASH_SUCCESS == s_flash_error_code)
                                {
                                    DEBUG_LOG("OK\r\n");
                                    DEBUG_LOG2("bank 0 status = 0x%x [%s]\r\n",
                                            sp_fwup_control_block_bank0->image_flag,
                                            get_status_string(sp_fwup_control_block_bank0->image_flag));
                                    DEBUG_LOG2("bank 1 status = 0x%x [%s]\r\n",
                                            sp_fwup_control_block_bank1->image_flag,
                                            get_status_string(sp_fwup_control_block_bank1->image_flag));
                                }
                                else
                                {
                                    DEBUG_LOG2("R_FLASH_Write() callback error. %d.\r\n", s_flash_error_code);
                                    DEBUG_LOG("system error.\r\n");
                                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                    secure_boot_error_code = FWUP_FAIL;
                                    break;
                                }

                                /* Erase Data Flash */
                                DEBUG_LOG("erase install area (data flash): ");
                                flash_api_error_code = fwup_flash_erase(
                                        (flash_block_address_t) BOOT_LOADER_USER_CONST_DATA_LOW_ADDRESS,
                                        BOOT_LOADER_UPDATE_CONST_DATA_TARGET_BLOCK_NUMBER);
                                if (FLASH_SUCCESS != flash_api_error_code)
                                {
                                    DEBUG_LOG2("R_FLASH_Erase() returns error. %d.\r\n", s_flash_error_code);
                                    DEBUG_LOG("system error.\r\n");
                                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                    secure_boot_error_code = FWUP_FAIL;
                                    break;
                                }
#if (FLASH_CFG_DATA_FLASH_BGO == 1)
                                fwup_update_status(FWUP_STATE_EOL_DATA_FLASH_ERASE_WAIT);
#else
                                fwup_update_status(FWUP_STATE_EOL_DATA_FLASH_ERASE_COMPLETE);
#endif  /* (FLASH_CFG_DATA_FLASH_BGO == 1) */
                            break;

                            case FWUP_STATE_EOL_DATA_FLASH_ERASE_WAIT:

                                /* this state will be update by flash callback */
                            break;

                            case FWUP_STATE_EOL_DATA_FLASH_ERASE_COMPLETE:
                                if (FLASH_SUCCESS == s_flash_error_code)
                                {
                                    DEBUG_LOG("OK\r\n");
                                }
                                else
                                {
                                    DEBUG_LOG2("R_FLASH_Erase() callback error. %d.\r\n", s_flash_error_code);
                                    DEBUG_LOG("system error.\r\n");
                                    fwup_update_status(FWUP_STATE_FATAL_ERROR);
                                    secure_boot_error_code = FWUP_FAIL;
                                    break;
                                }

                                /* End of the EOL process, infinity loop on Bootloader */
                                DEBUG_LOG("End Of Life process finished.\r\n");
                                R_BSP_SoftwareDelay(1000, BSP_DELAY_MILLISECS);
                                secure_boot_error_code = FWUP_END_OF_LIFE;
                            break;
                            default:
                                R_BSP_NOP();  /* Don't run this part.*/
                            break;
                        }
                    break;

                    default:
                        DEBUG_LOG2("illegal flash rom status code 0x%x.\r\n",
                                sp_fwup_control_block_bank0->image_flag);
                        DEBUG_LOG("Code flash is completely broken.\r\n");
                        DEBUG_LOG("Please erase all code flash.\r\n");
                        DEBUG_LOG("And, write secure boot using debugger.\r\n");
                        fwup_update_status(FWUP_STATE_FATAL_ERROR);
                        secure_boot_error_code = FWUP_FAIL;
                    break;
                }
                break;

            default:
            break;
        }
    }
    
    /* Close System-timer if boot process will end */
    if ((FWUP_SUCCESS == secure_boot_error_code) ||
        (FWUP_FAIL == secure_boot_error_code) ||
        (FWUP_END_OF_LIFE == secure_boot_error_code))
    {
        monitoring_error_code = fwup_state_monitoring_stop();
        if (MONI_SUCCESS != monitoring_error_code)
        {
            DEBUG_LOG2("R_SYS_TIME_Close() returns error. %d.\r\n", monitoring_error_code);
            DEBUG_LOG("system error.\r\n");
            fwup_update_status(FWUP_STATE_FATAL_ERROR);
            secure_boot_error_code = FWUP_FAIL;
        }
    }
    return secure_boot_error_code;
}
/**********************************************************************************************************************
 End of function R_FWUP_SecureBoot
 *********************************************************************************************************************/

