vinh107108/amazon-freertos/projects/renesas/rx65n-rsk/e2studio/boot_loader/src/smc_gen/r_fwup/src/r_fwup_boot_loader.c
/***********************************************************************************************************************
 * Function Name: R_FWUP_ExecuteFirmware
 * Description  :
 * Arguments    :
 * Return Value :
 **********************************************************************************************************************/
void R_FWUP_ExecuteFirmware(void)
{
#if (BSP_MCU_SERIES_RX700 || BSP_MCU_SERIES_RX600 || BSP_MCU_SERIES_RX200 || BSP_MCU_SERIES_RX100)
    uint32_t addr;

    /* stop all interrupt completely */
    R_BSP_SET_PSW(0);
    addr = *(uint32_t*) USER_RESET_VECTOR_ADDRESS; /* CODE CHECKER, this is OK as a comment aligns with the cast */
    ((void (*) ()) addr)();
#else
    /* Fix me for other MCU family */
#endif /* BSP_MCU_SERIES_RX700 || BSP_MCU_SERIES_RX600 || BSP_MCU_SERIES_RX200 || BSP_MCU_SERIES_RX100 */
}
/**********************************************************************************************************************
 End of function R_FWUP_ExecuteFirmware
 *********************************************************************************************************************/

/***********************************************************************************************************************
 * Function Name: software_reset
 * Description  :
 * Arguments    :
 * Return Value :
 **********************************************************************************************************************/
static void software_reset(void)
{

    /* stop all interrupt completely */
    R_BSP_SET_PSW(0);
    fwup_interrupts_disable();
    fwup_register_protect_disable();
    R_BSP_SoftwareReset();
    while (1)
    {
        R_BSP_NOP(); /* software reset */
    }
}
/**********************************************************************************************************************
 End of function software_reset
 *********************************************************************************************************************/

/***********************************************************************************************************************
 * Function Name: bank_swap_with_software_reset
 * Description  :
 * Arguments    :
 * Return Value :
 **********************************************************************************************************************/
static void bank_swap_with_software_reset(void)
{

    /* stop all interrupt completely */
    R_BSP_SET_PSW(0);
    fwup_interrupts_disable();
    fwup_flash_set_bank_toggle();
    fwup_register_protect_disable();
    R_BSP_SoftwareReset();
    while (1)
    {
        R_BSP_NOP(); /* software reset */
    }
}
/**********************************************************************************************************************
 End of function bank_swap_with_software_reset
 *********************************************************************************************************************/

/***********************************************************************************************************************
 * Function Name: firm_block_read
 * Description  :
 * Arguments    :
 * Return Value :
 **********************************************************************************************************************/
static int32_t firm_block_read(uint32_t *firmware, uint32_t offset)
{
    int32_t error_code = -1;
    if (BOOT_LOADER_SCI_RECEIVE_BUFFER_FULL == s_sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_A].buffer_full_flag)
    {
        memcpy(firmware, s_sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_A].buffer, FWUP_WRITE_BLOCK_SIZE);
        s_sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_A].buffer_full_flag = BOOT_LOADER_SCI_RECEIVE_BUFFER_EMPTY;
        error_code = 0;
    }
    else if (BOOT_LOADER_SCI_RECEIVE_BUFFER_FULL
            == s_sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_B].buffer_full_flag)
    {
        memcpy(firmware, s_sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_B].buffer, FWUP_WRITE_BLOCK_SIZE);
        s_sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_B].buffer_full_flag = BOOT_LOADER_SCI_RECEIVE_BUFFER_EMPTY;
        error_code = 0;
    }
    else
    {
        error_code = -1;
    }
    return error_code;
}
/**********************************************************************************************************************
 End of function firm_block_read
 *********************************************************************************************************************/

/***********************************************************************************************************************
 * Function Name: const_data_block_read
 * Description  :
 * Arguments    :
 * Return Value :
 **********************************************************************************************************************/
static int32_t const_data_block_read(uint32_t *const_data, uint32_t offset)
{
    int32_t error_code = -1;
    if (BOOT_LOADER_SCI_RECEIVE_BUFFER_FULL == s_sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_A].buffer_full_flag)
    {
        memcpy(const_data, s_sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_A].buffer, FWUP_WRITE_BLOCK_SIZE);
        s_sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_A].buffer_full_flag = BOOT_LOADER_SCI_RECEIVE_BUFFER_EMPTY;
        error_code = 0;
    }
    else if (BOOT_LOADER_SCI_RECEIVE_BUFFER_FULL
            == s_sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_B].buffer_full_flag)
    {
        memcpy(const_data, s_sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_B].buffer, FWUP_WRITE_BLOCK_SIZE);
        s_sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_B].buffer_full_flag = BOOT_LOADER_SCI_RECEIVE_BUFFER_EMPTY;
        error_code = 0;
    }
    else
    {
        error_code = -1;
    }
    return error_code;
}
/**********************************************************************************************************************
 End of function const_data_block_read
 *********************************************************************************************************************/

#if (FWUP_CFG_OTA_DATA_STORAGE == 1)
/***********************************************************************************************************************
 * Function Name: s_copy_data_area
 * Description  :
 * Arguments    :
 * Return Value :
 **********************************************************************************************************************/
static flash_err_t s_copy_data_area(void)
{
    flash_err_t ret = FLASH_SUCCESS;

    switch (fwup_get_status())
    {
        case FWUP_STATE_BANK1_UPDATE_DATA_AREA_ERASE:
            /* Erase data area of Temporary */
            DEBUG_LOG("copy data area (code flash): ");
            ret = fwup_flash_erase(
                    (flash_block_address_t) BOOT_LOADER_UPDATE_TEMPORARY_DATA_LOW_ADDRESS,
                    BOOT_LOADER_UPDATE_CONST_DATA_TARGET_BLOCK_NUMBER);

            if (FLASH_SUCCESS != ret)
            {
                DEBUG_LOG("NG\r\n");
                DEBUG_LOG2("R_FLASH_Erase() returns error code = %d.\r\n", ret);
            }
            else
            {
#if (FLASH_CFG_CODE_FLASH_BGO == 1)
                fwup_update_status(FWUP_STATE_BANK1_UPDATE_DATA_AREA_ERASE_WAIT);
#else
                fwup_update_status(FWUP_STATE_BANK1_UPDATE_DATA_AREA_ERASE_COMPLETE);
#endif /* FLASH_CFG_CODE_FLASH_BGO == 1 */
            }
            break;

        case FWUP_STATE_BANK1_UPDATE_DATA_AREA_ERASE_WAIT:
            /* Wait of erase */
            R_BSP_NOP();
            break;

        case FWUP_STATE_BANK1_UPDATE_DATA_AREA_ERASE_COMPLETE:
            if (FLASH_SUCCESS != s_flash_error_code)
            {
                DEBUG_LOG("NG\r\n");
                DEBUG_LOG2("R_FLASH_Erase() callback error. %d.\r\n", s_flash_error_code);
                DEBUG_LOG("system error.\r\n");
                ret = FLASH_ERR_FAILURE;
            }
            else
            {
                /* Copy data from Execute to Temporary */
                ret = fwup_flash_write((uint32_t)BOOT_LOADER_UPDATE_EXECUTE_DATA_LOW_ADDRESS,
                        (uint32_t)BOOT_LOADER_UPDATE_TEMPORARY_DATA_LOW_ADDRESS,
                        BOOT_LOADER_CF_DF_BLOCK_SIZE);

                if (FLASH_SUCCESS != ret)
                {
                    DEBUG_LOG("NG\r\n");
                    DEBUG_LOG2("R_FLASH_Write() returns error code = %d.\r\n", ret);
                }
                else
                {
#if (FLASH_CFG_CODE_FLASH_BGO == 1)
                    fwup_update_status(FWUP_STATE_BANK1_UPDATE_DATA_AREA_COPY_WAIT);
#else
                    fwup_update_status(FWUP_STATE_BANK1_UPDATE_DATA_AREA_COPY_COMPLETE);
#endif /* FLASH_CFG_CODE_FLASH_BGO == 1 */
                }
            }
            break;

        case FWUP_STATE_BANK1_UPDATE_DATA_AREA_COPY_WAIT:
            /* Wait of copy */
            R_BSP_NOP();
            break;

