vinh107108/amazon-freertos/projects/renesas/rx65n-rsk/e2studio/boot_loader/src/smc_gen/r_fwup/src/r_fwup_boot_loader.c
        case FWUP_STATE_BANK1_UPDATE_DATA_AREA_COPY_COMPLETE:
            if (FLASH_SUCCESS != s_flash_error_code)
            {
                DEBUG_LOG("NG\r\n");
                DEBUG_LOG2("R_FLASH_Write() callback error. %d.\r\n", s_flash_error_code);
                DEBUG_LOG("system error.\r\n");
                ret = FLASH_ERR_FAILURE;
            }
            else
            {
                DEBUG_LOG("OK\r\n");
                fwup_update_status(FWUP_STATE_BANK1_UPDATE_COPY_FLAG_ERASE);
            }
            break;

        default:
            break;
    }

    return ret;
}
/**********************************************************************************************************************
 End of function s_copy_data_area
 *********************************************************************************************************************/

/***********************************************************************************************************************
 * Function Name: s_set_copy_flag
 * Description  :
 * Arguments    :
 * Return Value :
 **********************************************************************************************************************/
static flash_err_t s_set_copy_flag(void)
{
    flash_err_t ret = FLASH_SUCCESS;

    st_fwup_control_block_t * p_fwup_control_block
            = (st_fwup_control_block_t *)s_block_buffer;

    switch (fwup_get_status())
    {
        case FWUP_STATE_BANK1_UPDATE_COPY_FLAG_ERASE:
            DEBUG_LOG("modify data copy flag: ");
            /* Backup rsu header block data */
            memcpy(s_block_buffer, (void*)BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS,
                    BOOT_LOADER_FLASH_CF_BLOCK_SIZE);

            /* Change data_copy_flag */
            p_fwup_control_block->data_copy_flag = FWUP_COPY_FLAG_ON;

            /* Erase 1 block of Temporary area */
            ret = fwup_flash_erase(
                    (flash_block_address_t) BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS, 1);

            if (FLASH_SUCCESS != ret)
            {
                DEBUG_LOG("NG\r\n");
                DEBUG_LOG2("R_FLASH_Erase() returns error. %d.\r\n", s_flash_error_code);
                DEBUG_LOG("system error.\r\n");
            }
            else
            {
#if (FLASH_CFG_CODE_FLASH_BGO == 1)
                fwup_update_status(FWUP_STATE_BANK1_UPDATE_COPY_FLAG_ERASE_WAIT);
#else
                fwup_update_status(FWUP_STATE_BANK1_UPDATE_COPY_FLAG_ERASE_COMPLETE);
#endif /* FLASH_CFG_CODE_FLASH_BGO == 1 */
            }
            break;

        case FWUP_STATE_BANK1_UPDATE_COPY_FLAG_ERASE_WAIT:
            /* Wait of erase */
            R_BSP_NOP();
            break;

        case FWUP_STATE_BANK1_UPDATE_COPY_FLAG_ERASE_COMPLETE:
            if (FLASH_SUCCESS != s_flash_error_code)
            {
                DEBUG_LOG("NG\r\n");
                DEBUG_LOG2("R_FLASH_Erase() callback error. %d.\r\n", s_flash_error_code);
                DEBUG_LOG("system error.\r\n");
                ret = FLASH_ERR_FAILURE;
            }
            else
            {
                /* Write rsu header block */
                ret = fwup_flash_write((uint32_t) p_fwup_control_block,
                        (uint32_t) BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS,
                        BOOT_LOADER_FLASH_CF_BLOCK_SIZE);

                if (FLASH_SUCCESS != ret)
                {
                    DEBUG_LOG("NG\r\n");
                    DEBUG_LOG2("R_WRITE_Write() returns error code = %d.\r\n", ret);
                    ret = FLASH_ERR_FAILURE;
                }
                else
                {
#if (FLASH_CFG_CODE_FLASH_BGO == 1)
                    fwup_update_status(FWUP_STATE_BANK1_UPDATE_COPY_FLAG_WRITE_WAIT);
#else
                    fwup_update_status(FWUP_STATE_BANK1_UPDATE_COPY_FLAG_WRITE_COMPLETE);
#endif /* FLASH_CFG_CODE_FLASH_BGO == 1 */
                }
            }
            break;

        case FWUP_STATE_BANK1_UPDATE_COPY_FLAG_WRITE_WAIT:
            /* Wait of write */
            R_BSP_NOP();
            break;

        case FWUP_STATE_BANK1_UPDATE_COPY_FLAG_WRITE_COMPLETE:
            if (FLASH_SUCCESS != s_flash_error_code)
            {
                DEBUG_LOG("NG\r\n");
                DEBUG_LOG2("R_FLASH_Write() callback error. %d.\r\n", s_flash_error_code);
                DEBUG_LOG("system error.\r\n");
                ret = FLASH_ERR_FAILURE;
            }
            else
            {
                DEBUG_LOG("OK\r\n");
                fwup_update_status(FWUP_STATE_FINALIZE);
            }
            break;

        default:
            break;
    }

    return ret;
}
/**********************************************************************************************************************
 End of function s_set_copy_flag
 *********************************************************************************************************************/
#endif /* FWUP_CFG_OTA_DATA_STORAGE == 1 */

/*****************************************************************************
 * Function Name: my_sci_callback
 * Description  : This is a template for an SCI Async Mode callback function.
 * Arguments    : pArgs -
 *                pointer to sci_cb_p_args_t structure cast to a void. Structure
 *                contains event and associated data.
 * Return Value : none
 ******************************************************************************/
void my_sci_callback(void *pArgs)
{
    sci_cb_args_t * p_args;

    p_args = (sci_cb_args_t*) pArgs;     /* CODE CHECKER, this is OK as a comment aligns with the cast */

    switch (p_args->event)
    {
    case SCI_EVT_RX_CHAR:

    	/* From RXI interrupt; received character data is in p_args->byte */
        if (s_sci_receive_control_block.p_sci_buffer_control->buffer_occupied_byte_size <
                (sizeof(s_sci_receive_control_block.p_sci_buffer_control->buffer)))
        {
            R_SCI_Receive(p_args->hdl,
                    &s_sci_receive_control_block.p_sci_buffer_control->
                    buffer[s_sci_receive_control_block.p_sci_buffer_control->buffer_occupied_byte_size++],
                    1);
            if ((sizeof(s_sci_receive_control_block.p_sci_buffer_control->buffer)) ==
                    s_sci_receive_control_block.p_sci_buffer_control->buffer_occupied_byte_size)
            {
#if (FLASH_CFG_CODE_FLASH_BGO == 0)
#if (BSP_MCU_SERIES_RX600 || BSP_MCU_SERIES_RX200 || BSP_MCU_SERIES_RX100)  /* for RTS control */
                FWUP_CFG_PORT_SYMBOL.PODR.BIT.FWUP_CFG_BIT_SYMBOL = 1;
                FWUP_CFG_PORT_SYMBOL.PDR.BIT.FWUP_CFG_BIT_SYMBOL = 1;
                FWUP_CFG_PORT_SYMBOL.PMR.BIT.FWUP_CFG_BIT_SYMBOL = 0;
#endif /* BSP_MCU_SERIES_RX600 || BSP_MCU_SERIES_RX200 || BSP_MCU_SERIES_RX100 */
#endif /* FLASH_CFG_CODE_FLASH_BGO == 0 */
                s_sci_receive_control_block.p_sci_buffer_control->buffer_occupied_byte_size = 0;
                s_sci_receive_control_block.p_sci_buffer_control->buffer_full_flag = BOOT_LOADER_SCI_RECEIVE_BUFFER_FULL;
                s_sci_receive_control_block.total_byte_size += FWUP_WRITE_BLOCK_SIZE;
                if (BOOT_LOADER_SCI_CONTROL_BLOCK_A == s_sci_receive_control_block.current_state)
                {
                    s_sci_receive_control_block.current_state = BOOT_LOADER_SCI_CONTROL_BLOCK_B;
                    s_sci_receive_control_block.p_sci_buffer_control
                            = &s_sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_B];
                }
                else
                {
                    s_sci_receive_control_block.current_state = BOOT_LOADER_SCI_CONTROL_BLOCK_A;
                    s_sci_receive_control_block.p_sci_buffer_control
                            = &s_sci_buffer_control[BOOT_LOADER_SCI_CONTROL_BLOCK_A];
                }
                g_rcv_count1++;
            }
            g_rcv_count2++;
        }
        break;
    case SCI_EVT_RXBUF_OVFL:

        /* From RXI interrupt; rx queue is full; 'lost' data is in p_args->byte
         You will need to increase buffer size or reduce baud rate */
        R_BSP_NOP();
        g_error_count1++;
        break;
    case SCI_EVT_OVFL_ERR:

        /* From receiver overflow error interrupt; error data is in p_args->byte
         Error condition is cleared in calling interrupt routine */
        R_BSP_NOP();
        g_error_count2++;
        break;
    case SCI_EVT_FRAMING_ERR:

        /* From receiver framing error interrupt; error data is in p_args->byte
         Error condition is cleared in calling interrupt routine */
        R_BSP_NOP();
        break;
    case SCI_EVT_PARITY_ERR:

        /* From receiver parity error interrupt; error data is in p_args->byte
         Error condition is cleared in calling interrupt routine */
        R_BSP_NOP();
        break;
    default:
        R_BSP_NOP(); /* Do nothing */
        break;
    }
}
/**********************************************************************************************************************
 End of function my_sci_callback
 *********************************************************************************************************************/

#if (FLASH_CFG_CODE_FLASH_BGO == 1)
/***********************************************************************************************************************
* Function Name: my_flash_callback
* Description  :
* Arguments    :
* Return Value :
***********************************************************************************************************************/
static void my_flash_callback(void *event)
{
    flash_int_cb_args_t * p_event = event;

    s_flash_error_code = FLASH_ERR_FAILURE;

    if ((FLASH_INT_EVENT_WRITE_COMPLETE == p_event->event) || (FLASH_INT_EVENT_ERASE_COMPLETE == p_event->event))
    {
        s_flash_error_code = FLASH_SUCCESS;
    }

    switch (fwup_get_status())
    {
        case FWUP_STATE_BANK1_UPDATE_LIFECYCLE_ERASE_WAIT:
            fwup_update_status(FWUP_STATE_BANK1_UPDATE_LIFECYCLE_ERASE_COMPLETE);
            break;
        case FWUP_STATE_BANK1_UPDATE_LIFECYCLE_WRITE_WAIT:
            fwup_update_status(FWUP_STATE_BANK1_UPDATE_LIFECYCLE_WRITE_COMPLETE);
            break;
        case FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_WAIT:
            fwup_update_status(FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_ERASE_COMPLETE);
            break;
        case FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_WAIT:
            fwup_update_status(FWUP_STATE_BANK0_INSTALL_SECURE_BOOT_WRITE_COMPLETE);
            break;
        case FWUP_STATE_INSTALL_DATA_FLASH_ERASE_WAIT:
            fwup_update_status(FWUP_STATE_INSTALL_DATA_FLASH_ERASE_COMPLETE);
            break;
        case FWUP_STATE_BANK0_INSTALL_CODE_FLASH_ERASE_WAIT:
            fwup_update_status(FWUP_STATE_BANK0_INSTALL_CODE_FLASH_ERASE_COMPLETE);
            break;
        case FWUP_STATE_BANK0_INSTALL_CODE_FLASH_WRITE_WAIT:
            fwup_update_status(FWUP_STATE_BANK0_INSTALL_CODE_FLASH_WRITE_COMPLETE);
            break;
        case FWUP_STATE_INSTALL_DATA_FLASH_WRITE_WAIT:
            fwup_update_status(FWUP_STATE_INSTALL_DATA_FLASH_WRITE_COMPLETE);
            break;
        case FWUP_STATE_BANK1_UPDATE_CODE_FLASH_ERASE_WAIT:
            fwup_update_status(FWUP_STATE_BANK1_UPDATE_CODE_FLASH_ERASE_COMPLETE);
            break;
        case FWUP_STATE_BANK1_UPDATE_DATA_AREA_ERASE_WAIT:
            fwup_update_status(FWUP_STATE_BANK1_UPDATE_DATA_AREA_ERASE_COMPLETE);
            break;
        case FWUP_STATE_BANK1_UPDATE_DATA_AREA_COPY_WAIT:
            fwup_update_status(FWUP_STATE_BANK1_UPDATE_DATA_AREA_COPY_COMPLETE);
            break;
        case FWUP_STATE_BANK1_UPDATE_COPY_FLAG_ERASE_WAIT:
            fwup_update_status(FWUP_STATE_BANK1_UPDATE_COPY_FLAG_ERASE_COMPLETE);
            break;
        case FWUP_STATE_BANK1_UPDATE_COPY_FLAG_WRITE_WAIT:
            fwup_update_status(FWUP_STATE_BANK1_UPDATE_COPY_FLAG_WRITE_COMPLETE);
            break;
        case FWUP_STATE_EOL_BANK1_ERASE_WAIT:
            fwup_update_status(FWUP_STATE_EOL_BANK1_ERASE_COMPLETE);
            break;
        case FWUP_STATE_EOL_BANK1_LIFECYCLE_WRITE_WAIT:
            fwup_update_status(FWUP_STATE_EOL_BANK1_LIFECYCLE_WRITE_COMPLETE);
            break;
        case FWUP_STATE_EOL_DATA_FLASH_ERASE_WAIT:
            fwup_update_status(FWUP_STATE_EOL_DATA_FLASH_ERASE_COMPLETE);
            break;
        default:
            break;
    }
}
/**********************************************************************************************************************
 End of function my_flash_callback
 *********************************************************************************************************************/
#endif /* FLASH_CFG_CODE_FLASH_BGO == 1 */

