vinh107108/amazon-freertos/projects/renesas/rx65n-rsk/e2studio/boot_loader/src/smc_gen/r_fwup/src/r_fwup_boot_loader.c
/***********************************************************************************************************************
* Function Name: get_status_string
* Description  :
* Arguments    :
* Return Value :
***********************************************************************************************************************/
static const uint8_t* get_status_string(uint8_t status)
{
    static const uint8_t s_status_string[][64] =
    {
    { "LIFECYCLE_STATE_BLANK" },
    { "LIFECYCLE_STATE_TESTING" },
    { "LIFECYCLE_STATE_INSTALLING" },
    { "LIFECYCLE_STATE_VALID" },
    { "LIFECYCLE_STATE_INVALID" },
    { "LIFECYCLE_STATE_EOL" },
    { "LIFECYCLE_STATE_UNKNOWN" } };
    const uint8_t * p_tmp;

    switch (status)
    {
    case LIFECYCLE_STATE_BLANK:
        p_tmp = s_status_string[0];
        break;
    case LIFECYCLE_STATE_TESTING:
        p_tmp = s_status_string[1];
        break;
    case LIFECYCLE_STATE_INSTALLING:
        p_tmp = s_status_string[2];
        break;
    case LIFECYCLE_STATE_VALID:
        p_tmp = s_status_string[3];
        break;
    case LIFECYCLE_STATE_INVALID:
        p_tmp = s_status_string[4];
        break;
    case LIFECYCLE_STATE_EOL:
        p_tmp = s_status_string[5];
        break;
    default:
        p_tmp = s_status_string[6];
        break;
    }
    return p_tmp;
}
/**********************************************************************************************************************
 End of function get_status_string
 *********************************************************************************************************************/

#if (FWUP_UNIT_TEST == 1)
void g_setting_unit_test_s_flash_error_code (uint32_t val)
{
    s_flash_error_code = val;
}

void g_setting_unit_test_s_sci_buffer_control (void)
{
    s_sci_buffer_control[0].buffer_full_flag = BOOT_LOADER_SCI_RECEIVE_BUFFER_FULL;
}

void g_setting_unit_test_s_load_fw_control_block (uint32_t addr)
{
    s_load_fw_control_block.offset = addr;
}

void g_setting_unit_test_s_load_const_data_control_block (uint32_t addr)
{
    s_load_const_data_control_block.offset = addr;
}
#endif /* FWUP_UNIT_TEST */
#endif /* FWUP_CFG_IMPLEMENTATION_ENVIRONMENT == FWUP_IMPLEMENTATION_BOOTLOADER */
